program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2"}})]
{
    func main<ios15>(tensor<int32, [1, 128]> attention_mask, tensor<int32, [1, 128]> input_ids, tensor<int32, [1, 128]> token_type_ids) {
            tensor<int32, [1]> input_tensor_1_axes_0 = const()[name = tensor<string, []>("input_tensor_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1, 1, 128]> input_tensor_1 = expand_dims(axes = input_tensor_1_axes_0, x = attention_mask)[name = tensor<string, []>("input_tensor_1")];
            tensor<int32, [1]> input_tensor_3_axes_0 = const()[name = tensor<string, []>("input_tensor_3_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1, 1, 1, 128]> input_tensor_3 = expand_dims(axes = input_tensor_3_axes_0, x = input_tensor_1)[name = tensor<string, []>("input_tensor_3")];
            tensor<fp16, []> Constant_value_to_fp16 = const()[name = tensor<string, []>("Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<string, []> second_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("second_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, 128]> cast_339 = cast(dtype = second_1_to_fp16_dtype_0, x = input_tensor_3)[name = tensor<string, []>("cast_339")];
            tensor<fp16, [1, 1, 1, 128]> first_3_cast_fp16 = sub(x = Constant_value_to_fp16, y = cast_339)[name = tensor<string, []>("first_3_cast_fp16")];
            tensor<fp16, []> Constant_1_value_to_fp16 = const()[name = tensor<string, []>("Constant_1_value_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 1, 1, 128]> second_27_cast_fp16 = mul(x = first_3_cast_fp16, y = Constant_1_value_to_fp16)[name = tensor<string, []>("second_27_cast_fp16")];
            tensor<int32, []> first_5_axis_0 = const()[name = tensor<string, []>("first_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [30522, 1024]> initializers_onnx_initializer_0_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_0_to_fp16"), val = tensor<fp16, [30522, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 128, 1024]> first_5_cast_fp16 = gather(axis = first_5_axis_0, indices = input_ids, x = initializers_onnx_initializer_0_to_fp16)[name = tensor<string, []>("first_5_cast_fp16")];
            tensor<int32, []> second_5_axis_0 = const()[name = tensor<string, []>("second_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2, 1024]> initializers_onnx_initializer_1_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_1_to_fp16"), val = tensor<fp16, [2, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62509184)))];
            tensor<fp16, [1, 128, 1024]> second_5_cast_fp16 = gather(axis = second_5_axis_0, indices = token_type_ids, x = initializers_onnx_initializer_1_to_fp16)[name = tensor<string, []>("second_5_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_7_cast_fp16 = add(x = first_5_cast_fp16, y = second_5_cast_fp16)[name = tensor<string, []>("first_7_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> second_7_to_fp16 = const()[name = tensor<string, []>("second_7_to_fp16"), val = tensor<fp16, [1, 128, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62513344)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_15_cast_fp16 = add(x = first_7_cast_fp16, y = second_7_to_fp16)[name = tensor<string, []>("input_tensor_15_cast_fp16")];
            tensor<bool, []> var_1961 = const()[name = tensor<string, []>("op_1961"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1963 = const()[name = tensor<string, []>("op_1963"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_9_cast_fp16 = reduce_mean(axes = var_1963, keep_dims = var_1961, x = input_tensor_15_cast_fp16)[name = tensor<string, []>("second_9_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_17_cast_fp16 = sub(x = input_tensor_15_cast_fp16, y = second_9_cast_fp16)[name = tensor<string, []>("input_tensor_17_cast_fp16")];
            tensor<fp16, []> embeddings_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("embeddings_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 1024]> input_tensor_19_cast_fp16 = pow(x = input_tensor_17_cast_fp16, y = embeddings_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_19_cast_fp16")];
            tensor<bool, []> var_1969 = const()[name = tensor<string, []>("op_1969"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1971 = const()[name = tensor<string, []>("op_1971"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_9_cast_fp16 = reduce_mean(axes = var_1971, keep_dims = var_1969, x = input_tensor_19_cast_fp16)[name = tensor<string, []>("first_9_cast_fp16")];
            tensor<fp16, []> embeddings_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("embeddings_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_21_cast_fp16 = add(x = first_9_cast_fp16, y = embeddings_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_21_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_13_cast_fp16 = sqrt(x = input_tensor_21_cast_fp16)[name = tensor<string, []>("second_13_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_11_cast_fp16 = real_div(x = input_tensor_17_cast_fp16, y = second_13_cast_fp16)[name = tensor<string, []>("first_11_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_3_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_3_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62775552)))];
            tensor<fp16, [1, 128, 1024]> first_13_cast_fp16 = mul(x = first_11_cast_fp16, y = initializers_onnx_initializer_3_to_fp16)[name = tensor<string, []>("first_13_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_4_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_4_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62777664)))];
            tensor<fp16, [1, 128, 1024]> x_3_cast_fp16 = add(x = first_13_cast_fp16, y = initializers_onnx_initializer_4_to_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_45_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_45_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62779776)))];
            tensor<fp16, [1024]> input_tensor_45_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_45_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64876992)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_45_cast_fp16 = linear(bias = input_tensor_45_bias_0_to_fp16, weight = input_tensor_45_weight_0_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_45_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_23_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_23_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64879104)))];
            tensor<fp16, [1024]> input_tensor_23_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_23_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66976320)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_23_cast_fp16 = linear(bias = input_tensor_23_bias_0_to_fp16, weight = input_tensor_23_weight_0_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_23_cast_fp16")];
            tensor<int32, [4]> var_2031 = const()[name = tensor<string, []>("op_2031"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_57_cast_fp16 = reshape(shape = var_2031, x = input_tensor_23_cast_fp16)[name = tensor<string, []>("input_tensor_57_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_33_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_33_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66978432)))];
            tensor<fp16, [1024]> input_tensor_33_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_33_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(69075648)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_33_cast_fp16 = linear(bias = input_tensor_33_bias_0_to_fp16, weight = input_tensor_33_weight_0_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_33_cast_fp16")];
            tensor<int32, [4]> var_2081 = const()[name = tensor<string, []>("op_2081"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_43_cast_fp16 = reshape(shape = var_2081, x = input_tensor_33_cast_fp16)[name = tensor<string, []>("input_tensor_43_cast_fp16")];
            tensor<int32, [4]> var_2087 = const()[name = tensor<string, []>("op_2087"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_2134 = const()[name = tensor<string, []>("op_2134"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_55_cast_fp16 = reshape(shape = var_2134, x = input_tensor_45_cast_fp16)[name = tensor<string, []>("input_tensor_55_cast_fp16")];
            tensor<bool, []> first_21_transpose_x_0 = const()[name = tensor<string, []>("first_21_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_21_transpose_y_0 = const()[name = tensor<string, []>("first_21_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_240_perm_0 = const()[name = tensor<string, []>("transpose_240_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_241_perm_0 = const()[name = tensor<string, []>("transpose_241_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 16, 64, 128]> transpose_381 = transpose(perm = transpose_241_perm_0, x = input_tensor_57_cast_fp16)[name = tensor<string, []>("transpose_381")];
            tensor<fp16, [1, 16, 128, 64]> transpose_382 = transpose(perm = transpose_240_perm_0, x = input_tensor_55_cast_fp16)[name = tensor<string, []>("transpose_382")];
            tensor<fp16, [1, 16, 128, 128]> first_21_cast_fp16 = matmul(transpose_x = first_21_transpose_x_0, transpose_y = first_21_transpose_y_0, x = transpose_382, y = transpose_381)[name = tensor<string, []>("first_21_cast_fp16")];
            tensor<fp16, []> _inversed_first_23_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_23_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 16, 128, 128]> _inversed_first_23_cast_fp16 = mul(x = first_21_cast_fp16, y = _inversed_first_23_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_23_cast_fp16")];
            tensor<fp16, [1, 16, 128, 128]> input_tensor_59_cast_fp16 = add(x = _inversed_first_23_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("input_tensor_59_cast_fp16")];
            tensor<int32, []> var_2153 = const()[name = tensor<string, []>("op_2153"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 16, 128, 128]> result_1_cast_fp16 = softmax(axis = var_2153, x = input_tensor_59_cast_fp16)[name = tensor<string, []>("result_1_cast_fp16")];
            tensor<bool, []> input_tensor_63_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_63_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_63_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_63_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 128, 64]> transpose_383 = transpose(perm = var_2087, x = input_tensor_43_cast_fp16)[name = tensor<string, []>("transpose_383")];
            tensor<fp16, [1, 16, 128, 64]> input_tensor_63_cast_fp16 = matmul(transpose_x = input_tensor_63_transpose_x_0, transpose_y = input_tensor_63_transpose_y_0, x = result_1_cast_fp16, y = transpose_383)[name = tensor<string, []>("input_tensor_63_cast_fp16")];
            tensor<int32, [4]> var_2171 = const()[name = tensor<string, []>("op_2171"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_2216 = const()[name = tensor<string, []>("op_2216"), val = tensor<int32, [3]>([1, 128, 1024])];
            tensor<fp16, [1, 128, 16, 64]> transpose_380 = transpose(perm = var_2171, x = input_tensor_63_cast_fp16)[name = tensor<string, []>("transpose_380")];
            tensor<fp16, [1, 128, 1024]> x_9_cast_fp16 = reshape(shape = var_2216, x = transpose_380)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, [1024, 1024]> first_27_weight_0_to_fp16 = const()[name = tensor<string, []>("first_27_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(69077760)))];
            tensor<fp16, [1024]> first_27_bias_0_to_fp16 = const()[name = tensor<string, []>("first_27_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71174976)))];
            tensor<fp16, [1, 128, 1024]> first_27_cast_fp16 = linear(bias = first_27_bias_0_to_fp16, weight = first_27_weight_0_to_fp16, x = x_9_cast_fp16)[name = tensor<string, []>("first_27_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_75_cast_fp16 = add(x = first_27_cast_fp16, y = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_75_cast_fp16")];
            tensor<bool, []> var_2224 = const()[name = tensor<string, []>("op_2224"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2226 = const()[name = tensor<string, []>("op_2226"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_31_cast_fp16 = reduce_mean(axes = var_2226, keep_dims = var_2224, x = input_tensor_75_cast_fp16)[name = tensor<string, []>("second_31_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_77_cast_fp16 = sub(x = input_tensor_75_cast_fp16, y = second_31_cast_fp16)[name = tensor<string, []>("input_tensor_77_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_attention_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 1024]> input_tensor_79_cast_fp16 = pow(x = input_tensor_77_cast_fp16, y = encoder_layer_0_attention_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_79_cast_fp16")];
            tensor<bool, []> var_2232 = const()[name = tensor<string, []>("op_2232"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2234 = const()[name = tensor<string, []>("op_2234"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_29_cast_fp16 = reduce_mean(axes = var_2234, keep_dims = var_2232, x = input_tensor_79_cast_fp16)[name = tensor<string, []>("first_29_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_attention_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_81_cast_fp16 = add(x = first_29_cast_fp16, y = encoder_layer_0_attention_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_81_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_35_cast_fp16 = sqrt(x = input_tensor_81_cast_fp16)[name = tensor<string, []>("second_35_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_31_cast_fp16 = real_div(x = input_tensor_77_cast_fp16, y = second_35_cast_fp16)[name = tensor<string, []>("first_31_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_13_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_13_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71177088)))];
            tensor<fp16, [1, 128, 1024]> first_33_cast_fp16 = mul(x = first_31_cast_fp16, y = initializers_onnx_initializer_13_to_fp16)[name = tensor<string, []>("first_33_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_14_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_14_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71179200)))];
            tensor<fp16, [1, 128, 1024]> x_11_cast_fp16 = add(x = first_33_cast_fp16, y = initializers_onnx_initializer_14_to_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [4096, 1024]> first_37_weight_0_to_fp16 = const()[name = tensor<string, []>("first_37_weight_0_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71181312)))];
            tensor<fp16, [4096]> first_37_bias_0_to_fp16 = const()[name = tensor<string, []>("first_37_bias_0_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79569984)))];
            tensor<fp16, [1, 128, 4096]> first_37_cast_fp16 = linear(bias = first_37_bias_0_to_fp16, weight = first_37_weight_0_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("first_37_cast_fp16")];
            tensor<string, []> x_13_mode_0 = const()[name = tensor<string, []>("x_13_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 4096]> x_13_cast_fp16 = gelu(mode = x_13_mode_0, x = first_37_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<fp16, [1024, 4096]> first_45_weight_0_to_fp16 = const()[name = tensor<string, []>("first_45_weight_0_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79578240)))];
            tensor<fp16, [1024]> first_45_bias_0_to_fp16 = const()[name = tensor<string, []>("first_45_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87966912)))];
            tensor<fp16, [1, 128, 1024]> first_45_cast_fp16 = linear(bias = first_45_bias_0_to_fp16, weight = first_45_weight_0_to_fp16, x = x_13_cast_fp16)[name = tensor<string, []>("first_45_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_85_cast_fp16 = add(x = first_45_cast_fp16, y = x_11_cast_fp16)[name = tensor<string, []>("input_tensor_85_cast_fp16")];
            tensor<bool, []> var_2258 = const()[name = tensor<string, []>("op_2258"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2260 = const()[name = tensor<string, []>("op_2260"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_53_cast_fp16 = reduce_mean(axes = var_2260, keep_dims = var_2258, x = input_tensor_85_cast_fp16)[name = tensor<string, []>("second_53_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_87_cast_fp16 = sub(x = input_tensor_85_cast_fp16, y = second_53_cast_fp16)[name = tensor<string, []>("input_tensor_87_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 1024]> input_tensor_89_cast_fp16 = pow(x = input_tensor_87_cast_fp16, y = encoder_layer_0_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_89_cast_fp16")];
            tensor<bool, []> var_2266 = const()[name = tensor<string, []>("op_2266"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2268 = const()[name = tensor<string, []>("op_2268"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_47_cast_fp16 = reduce_mean(axes = var_2268, keep_dims = var_2266, x = input_tensor_89_cast_fp16)[name = tensor<string, []>("first_47_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_91_cast_fp16 = add(x = first_47_cast_fp16, y = encoder_layer_0_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_91_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_57_cast_fp16 = sqrt(x = input_tensor_91_cast_fp16)[name = tensor<string, []>("second_57_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_49_cast_fp16 = real_div(x = input_tensor_87_cast_fp16, y = second_57_cast_fp16)[name = tensor<string, []>("first_49_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_19_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_19_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87969024)))];
            tensor<fp16, [1, 128, 1024]> first_51_cast_fp16 = mul(x = first_49_cast_fp16, y = initializers_onnx_initializer_19_to_fp16)[name = tensor<string, []>("first_51_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_20_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_20_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87971136)))];
            tensor<fp16, [1, 128, 1024]> x_15_cast_fp16 = add(x = first_51_cast_fp16, y = initializers_onnx_initializer_20_to_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_115_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_115_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87973248)))];
            tensor<fp16, [1024]> input_tensor_115_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_115_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90070464)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_115_cast_fp16 = linear(bias = input_tensor_115_bias_0_to_fp16, weight = input_tensor_115_weight_0_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_115_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_93_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_93_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90072576)))];
            tensor<fp16, [1024]> input_tensor_93_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_93_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(92169792)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_93_cast_fp16 = linear(bias = input_tensor_93_bias_0_to_fp16, weight = input_tensor_93_weight_0_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_93_cast_fp16")];
            tensor<int32, [4]> var_2328 = const()[name = tensor<string, []>("op_2328"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_127_cast_fp16 = reshape(shape = var_2328, x = input_tensor_93_cast_fp16)[name = tensor<string, []>("input_tensor_127_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_103_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_103_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(92171904)))];
            tensor<fp16, [1024]> input_tensor_103_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_103_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94269120)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_103_cast_fp16 = linear(bias = input_tensor_103_bias_0_to_fp16, weight = input_tensor_103_weight_0_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_103_cast_fp16")];
            tensor<int32, [4]> var_2378 = const()[name = tensor<string, []>("op_2378"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_113_cast_fp16 = reshape(shape = var_2378, x = input_tensor_103_cast_fp16)[name = tensor<string, []>("input_tensor_113_cast_fp16")];
            tensor<int32, [4]> var_2384 = const()[name = tensor<string, []>("op_2384"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_2431 = const()[name = tensor<string, []>("op_2431"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_125_cast_fp16 = reshape(shape = var_2431, x = input_tensor_115_cast_fp16)[name = tensor<string, []>("input_tensor_125_cast_fp16")];
            tensor<bool, []> first_59_transpose_x_0 = const()[name = tensor<string, []>("first_59_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_59_transpose_y_0 = const()[name = tensor<string, []>("first_59_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_242_perm_0 = const()[name = tensor<string, []>("transpose_242_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_243_perm_0 = const()[name = tensor<string, []>("transpose_243_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 16, 64, 128]> transpose_377 = transpose(perm = transpose_243_perm_0, x = input_tensor_127_cast_fp16)[name = tensor<string, []>("transpose_377")];
            tensor<fp16, [1, 16, 128, 64]> transpose_378 = transpose(perm = transpose_242_perm_0, x = input_tensor_125_cast_fp16)[name = tensor<string, []>("transpose_378")];
            tensor<fp16, [1, 16, 128, 128]> first_59_cast_fp16 = matmul(transpose_x = first_59_transpose_x_0, transpose_y = first_59_transpose_y_0, x = transpose_378, y = transpose_377)[name = tensor<string, []>("first_59_cast_fp16")];
            tensor<fp16, []> _inversed_first_61_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_61_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 16, 128, 128]> _inversed_first_61_cast_fp16 = mul(x = first_59_cast_fp16, y = _inversed_first_61_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_61_cast_fp16")];
            tensor<fp16, [1, 16, 128, 128]> input_tensor_129_cast_fp16 = add(x = _inversed_first_61_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("input_tensor_129_cast_fp16")];
            tensor<int32, []> var_2450 = const()[name = tensor<string, []>("op_2450"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 16, 128, 128]> result_3_cast_fp16 = softmax(axis = var_2450, x = input_tensor_129_cast_fp16)[name = tensor<string, []>("result_3_cast_fp16")];
            tensor<bool, []> input_tensor_133_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_133_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_133_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_133_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 128, 64]> transpose_379 = transpose(perm = var_2384, x = input_tensor_113_cast_fp16)[name = tensor<string, []>("transpose_379")];
            tensor<fp16, [1, 16, 128, 64]> input_tensor_133_cast_fp16 = matmul(transpose_x = input_tensor_133_transpose_x_0, transpose_y = input_tensor_133_transpose_y_0, x = result_3_cast_fp16, y = transpose_379)[name = tensor<string, []>("input_tensor_133_cast_fp16")];
            tensor<int32, [4]> var_2468 = const()[name = tensor<string, []>("op_2468"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_2513 = const()[name = tensor<string, []>("op_2513"), val = tensor<int32, [3]>([1, 128, 1024])];
            tensor<fp16, [1, 128, 16, 64]> transpose_376 = transpose(perm = var_2468, x = input_tensor_133_cast_fp16)[name = tensor<string, []>("transpose_376")];
            tensor<fp16, [1, 128, 1024]> x_21_cast_fp16 = reshape(shape = var_2513, x = transpose_376)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [1024, 1024]> first_65_weight_0_to_fp16 = const()[name = tensor<string, []>("first_65_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94271232)))];
            tensor<fp16, [1024]> first_65_bias_0_to_fp16 = const()[name = tensor<string, []>("first_65_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96368448)))];
            tensor<fp16, [1, 128, 1024]> first_65_cast_fp16 = linear(bias = first_65_bias_0_to_fp16, weight = first_65_weight_0_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("first_65_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_145_cast_fp16 = add(x = first_65_cast_fp16, y = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_145_cast_fp16")];
            tensor<bool, []> var_2521 = const()[name = tensor<string, []>("op_2521"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2523 = const()[name = tensor<string, []>("op_2523"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_73_cast_fp16 = reduce_mean(axes = var_2523, keep_dims = var_2521, x = input_tensor_145_cast_fp16)[name = tensor<string, []>("second_73_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_147_cast_fp16 = sub(x = input_tensor_145_cast_fp16, y = second_73_cast_fp16)[name = tensor<string, []>("input_tensor_147_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_attention_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 1024]> input_tensor_149_cast_fp16 = pow(x = input_tensor_147_cast_fp16, y = encoder_layer_1_attention_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_149_cast_fp16")];
            tensor<bool, []> var_2529 = const()[name = tensor<string, []>("op_2529"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2531 = const()[name = tensor<string, []>("op_2531"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_67_cast_fp16 = reduce_mean(axes = var_2531, keep_dims = var_2529, x = input_tensor_149_cast_fp16)[name = tensor<string, []>("first_67_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_attention_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_151_cast_fp16 = add(x = first_67_cast_fp16, y = encoder_layer_1_attention_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_151_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_77_cast_fp16 = sqrt(x = input_tensor_151_cast_fp16)[name = tensor<string, []>("second_77_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_69_cast_fp16 = real_div(x = input_tensor_147_cast_fp16, y = second_77_cast_fp16)[name = tensor<string, []>("first_69_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_29_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_29_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96370560)))];
            tensor<fp16, [1, 128, 1024]> first_71_cast_fp16 = mul(x = first_69_cast_fp16, y = initializers_onnx_initializer_29_to_fp16)[name = tensor<string, []>("first_71_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_30_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_30_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96372672)))];
            tensor<fp16, [1, 128, 1024]> x_23_cast_fp16 = add(x = first_71_cast_fp16, y = initializers_onnx_initializer_30_to_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<fp16, [4096, 1024]> first_75_weight_0_to_fp16 = const()[name = tensor<string, []>("first_75_weight_0_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96374784)))];
            tensor<fp16, [4096]> first_75_bias_0_to_fp16 = const()[name = tensor<string, []>("first_75_bias_0_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104763456)))];
            tensor<fp16, [1, 128, 4096]> first_75_cast_fp16 = linear(bias = first_75_bias_0_to_fp16, weight = first_75_weight_0_to_fp16, x = x_23_cast_fp16)[name = tensor<string, []>("first_75_cast_fp16")];
            tensor<string, []> x_25_mode_0 = const()[name = tensor<string, []>("x_25_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 4096]> x_25_cast_fp16 = gelu(mode = x_25_mode_0, x = first_75_cast_fp16)[name = tensor<string, []>("x_25_cast_fp16")];
            tensor<fp16, [1024, 4096]> first_83_weight_0_to_fp16 = const()[name = tensor<string, []>("first_83_weight_0_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104771712)))];
            tensor<fp16, [1024]> first_83_bias_0_to_fp16 = const()[name = tensor<string, []>("first_83_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113160384)))];
            tensor<fp16, [1, 128, 1024]> first_83_cast_fp16 = linear(bias = first_83_bias_0_to_fp16, weight = first_83_weight_0_to_fp16, x = x_25_cast_fp16)[name = tensor<string, []>("first_83_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_155_cast_fp16 = add(x = first_83_cast_fp16, y = x_23_cast_fp16)[name = tensor<string, []>("input_tensor_155_cast_fp16")];
            tensor<bool, []> var_2555 = const()[name = tensor<string, []>("op_2555"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2557 = const()[name = tensor<string, []>("op_2557"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_95_cast_fp16 = reduce_mean(axes = var_2557, keep_dims = var_2555, x = input_tensor_155_cast_fp16)[name = tensor<string, []>("second_95_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_157_cast_fp16 = sub(x = input_tensor_155_cast_fp16, y = second_95_cast_fp16)[name = tensor<string, []>("input_tensor_157_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 1024]> input_tensor_159_cast_fp16 = pow(x = input_tensor_157_cast_fp16, y = encoder_layer_1_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_159_cast_fp16")];
            tensor<bool, []> var_2563 = const()[name = tensor<string, []>("op_2563"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2565 = const()[name = tensor<string, []>("op_2565"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_85_cast_fp16 = reduce_mean(axes = var_2565, keep_dims = var_2563, x = input_tensor_159_cast_fp16)[name = tensor<string, []>("first_85_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_161_cast_fp16 = add(x = first_85_cast_fp16, y = encoder_layer_1_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_161_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_99_cast_fp16 = sqrt(x = input_tensor_161_cast_fp16)[name = tensor<string, []>("second_99_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_87_cast_fp16 = real_div(x = input_tensor_157_cast_fp16, y = second_99_cast_fp16)[name = tensor<string, []>("first_87_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_35_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_35_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113162496)))];
            tensor<fp16, [1, 128, 1024]> first_89_cast_fp16 = mul(x = first_87_cast_fp16, y = initializers_onnx_initializer_35_to_fp16)[name = tensor<string, []>("first_89_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_36_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_36_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113164608)))];
            tensor<fp16, [1, 128, 1024]> x_27_cast_fp16 = add(x = first_89_cast_fp16, y = initializers_onnx_initializer_36_to_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_185_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_185_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113166720)))];
            tensor<fp16, [1024]> input_tensor_185_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_185_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(115263936)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_185_cast_fp16 = linear(bias = input_tensor_185_bias_0_to_fp16, weight = input_tensor_185_weight_0_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_185_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_163_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_163_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(115266048)))];
            tensor<fp16, [1024]> input_tensor_163_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_163_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117363264)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_163_cast_fp16 = linear(bias = input_tensor_163_bias_0_to_fp16, weight = input_tensor_163_weight_0_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_163_cast_fp16")];
            tensor<int32, [4]> var_2625 = const()[name = tensor<string, []>("op_2625"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_197_cast_fp16 = reshape(shape = var_2625, x = input_tensor_163_cast_fp16)[name = tensor<string, []>("input_tensor_197_cast_fp16")];
            tensor<fp16, [1024, 1024]> input_tensor_173_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_173_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117365376)))];
            tensor<fp16, [1024]> input_tensor_173_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_173_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119462592)))];
            tensor<fp16, [1, 128, 1024]> input_tensor_173_cast_fp16 = linear(bias = input_tensor_173_bias_0_to_fp16, weight = input_tensor_173_weight_0_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_173_cast_fp16")];
            tensor<int32, [4]> var_2675 = const()[name = tensor<string, []>("op_2675"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_183_cast_fp16 = reshape(shape = var_2675, x = input_tensor_173_cast_fp16)[name = tensor<string, []>("input_tensor_183_cast_fp16")];
            tensor<int32, [4]> var_2681 = const()[name = tensor<string, []>("op_2681"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_2728 = const()[name = tensor<string, []>("op_2728"), val = tensor<int32, [4]>([1, 128, 16, 64])];
            tensor<fp16, [1, 128, 16, 64]> input_tensor_195_cast_fp16 = reshape(shape = var_2728, x = input_tensor_185_cast_fp16)[name = tensor<string, []>("input_tensor_195_cast_fp16")];
            tensor<bool, []> first_97_transpose_x_0 = const()[name = tensor<string, []>("first_97_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_97_transpose_y_0 = const()[name = tensor<string, []>("first_97_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_244_perm_0 = const()[name = tensor<string, []>("transpose_244_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_245_perm_0 = const()[name = tensor<string, []>("transpose_245_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 16, 64, 128]> transpose_373 = transpose(perm = transpose_245_perm_0, x = input_tensor_197_cast_fp16)[name = tensor<string, []>("transpose_373")];
            tensor<fp16, [1, 16, 128, 64]> transpose_374 = transpose(perm = transpose_244_perm_0, x = input_tensor_195_cast_fp16)[name = tensor<string, []>("transpose_374")];
            tensor<fp16, [1, 16, 128, 128]> first_97_cast_fp16 = matmul(transpose_x = first_97_transpose_x_0, transpose_y = first_97_transpose_y_0, x = transpose_374, y = transpose_373)[name = tensor<string, []>("first_97_cast_fp16")];
            tensor<fp16, []> _inversed_first_99_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_99_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 16, 128, 128]> _inversed_first_99_cast_fp16 = mul(x = first_97_cast_fp16, y = _inversed_first_99_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_99_cast_fp16")];
            tensor<fp16, [1, 16, 128, 128]> input_tensor_199_cast_fp16 = add(x = _inversed_first_99_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("input_tensor_199_cast_fp16")];
            tensor<int32, []> var_2747 = const()[name = tensor<string, []>("op_2747"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 16, 128, 128]> result_5_cast_fp16 = softmax(axis = var_2747, x = input_tensor_199_cast_fp16)[name = tensor<string, []>("result_5_cast_fp16")];
            tensor<bool, []> input_tensor_203_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_203_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_203_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_203_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 128, 64]> transpose_375 = transpose(perm = var_2681, x = input_tensor_183_cast_fp16)[name = tensor<string, []>("transpose_375")];
            tensor<fp16, [1, 16, 128, 64]> input_tensor_203_cast_fp16 = matmul(transpose_x = input_tensor_203_transpose_x_0, transpose_y = input_tensor_203_transpose_y_0, x = result_5_cast_fp16, y = transpose_375)[name = tensor<string, []>("input_tensor_203_cast_fp16")];
            tensor<int32, [4]> var_2765 = const()[name = tensor<string, []>("op_2765"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_2810 = const()[name = tensor<string, []>("op_2810"), val = tensor<int32, [3]>([1, 128, 1024])];
            tensor<fp16, [1, 128, 16, 64]> transpose_372 = transpose(perm = var_2765, x = input_tensor_203_cast_fp16)[name = tensor<string, []>("transpose_372")];
            tensor<fp16, [1, 128, 1024]> x_33_cast_fp16 = reshape(shape = var_2810, x = transpose_372)[name = tensor<string, []>("x_33_cast_fp16")];
            tensor<fp16, [1024, 1024]> first_103_weight_0_to_fp16 = const()[name = tensor<string, []>("first_103_weight_0_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119464704)))];
            tensor<fp16, [1024]> first_103_bias_0_to_fp16 = const()[name = tensor<string, []>("first_103_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(121561920)))];
            tensor<fp16, [1, 128, 1024]> first_103_cast_fp16 = linear(bias = first_103_bias_0_to_fp16, weight = first_103_weight_0_to_fp16, x = x_33_cast_fp16)[name = tensor<string, []>("first_103_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_215_cast_fp16 = add(x = first_103_cast_fp16, y = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_215_cast_fp16")];
            tensor<bool, []> var_2818 = const()[name = tensor<string, []>("op_2818"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2820 = const()[name = tensor<string, []>("op_2820"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_115_cast_fp16 = reduce_mean(axes = var_2820, keep_dims = var_2818, x = input_tensor_215_cast_fp16)[name = tensor<string, []>("second_115_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> input_tensor_217_cast_fp16 = sub(x = input_tensor_215_cast_fp16, y = second_115_cast_fp16)[name = tensor<string, []>("input_tensor_217_cast_fp16")];
            tensor<fp16, []> encoder_layer_2_attention_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 1024]> input_tensor_219_cast_fp16 = pow(x = input_tensor_217_cast_fp16, y = encoder_layer_2_attention_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_219_cast_fp16")];
            tensor<bool, []> var_2826 = const()[name = tensor<string, []>("op_2826"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2828 = const()[name = tensor<string, []>("op_2828"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_105_cast_fp16 = reduce_mean(axes = var_2828, keep_dims = var_2826, x = input_tensor_219_cast_fp16)[name = tensor<string, []>("first_105_cast_fp16")];
            tensor<fp16, []> encoder_layer_2_attention_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_221_cast_fp16 = add(x = first_105_cast_fp16, y = encoder_layer_2_attention_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_221_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_119_cast_fp16 = sqrt(x = input_tensor_221_cast_fp16)[name = tensor<string, []>("second_119_cast_fp16")];
            tensor<fp16, [1, 128, 1024]> first_107_cast_fp16 = real_div(x = input_tensor_217_cast_fp16, y = second_119_cast_fp16)[name = tensor<string, []>("first_107_cast_fp16")];
            tensor<fp16, [1024]> initializers_onnx_initializer_45_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_45_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(121564032)))];
            tensor<fp16, [1, 128, 1024]> first_109_cast_fp16 = mul(x = first_107_cast_fp16, y = initializers_onnx_initializer_45_to_fp16)[name = tensor<string, []>("first_109_cast_fp16")];
