program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2"}})]
{
    func main<ios15>(tensor<int32, [1, 128]> attention_mask, tensor<int32, [1, 128]> input_ids, tensor<int32, [1, 128]> token_type_ids) {
            tensor<int32, [1]> input_tensor_1_axes_0 = const()[name = tensor<string, []>("input_tensor_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1, 1, 128]> input_tensor_1 = expand_dims(axes = input_tensor_1_axes_0, x = attention_mask)[name = tensor<string, []>("input_tensor_1")];
            tensor<int32, [1]> input_tensor_3_axes_0 = const()[name = tensor<string, []>("input_tensor_3_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1, 1, 1, 128]> input_tensor_3 = expand_dims(axes = input_tensor_3_axes_0, x = input_tensor_1)[name = tensor<string, []>("input_tensor_3")];
            tensor<fp16, []> Constant_value_to_fp16 = const()[name = tensor<string, []>("Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<string, []> second_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("second_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, 128]> cast_171 = cast(dtype = second_1_to_fp16_dtype_0, x = input_tensor_3)[name = tensor<string, []>("cast_171")];
            tensor<fp16, [1, 1, 1, 128]> first_3_cast_fp16 = sub(x = Constant_value_to_fp16, y = cast_171)[name = tensor<string, []>("first_3_cast_fp16")];
            tensor<fp16, []> Constant_1_value_to_fp16 = const()[name = tensor<string, []>("Constant_1_value_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 1, 1, 128]> second_27_cast_fp16 = mul(x = first_3_cast_fp16, y = Constant_1_value_to_fp16)[name = tensor<string, []>("second_27_cast_fp16")];
            tensor<int32, []> first_5_axis_0 = const()[name = tensor<string, []>("first_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [30522, 384]> initializers_onnx_initializer_0_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_0_to_fp16"), val = tensor<fp16, [30522, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 128, 384]> first_5_cast_fp16 = gather(axis = first_5_axis_0, indices = input_ids, x = initializers_onnx_initializer_0_to_fp16)[name = tensor<string, []>("first_5_cast_fp16")];
            tensor<int32, []> second_5_axis_0 = const()[name = tensor<string, []>("second_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2, 384]> initializers_onnx_initializer_1_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_1_to_fp16"), val = tensor<fp16, [2, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23441024)))];
            tensor<fp16, [1, 128, 384]> second_5_cast_fp16 = gather(axis = second_5_axis_0, indices = token_type_ids, x = initializers_onnx_initializer_1_to_fp16)[name = tensor<string, []>("second_5_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_7_cast_fp16 = add(x = first_5_cast_fp16, y = second_5_cast_fp16)[name = tensor<string, []>("first_7_cast_fp16")];
            tensor<fp16, [1, 128, 384]> second_7_to_fp16 = const()[name = tensor<string, []>("second_7_to_fp16"), val = tensor<fp16, [1, 128, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23442624)))];
            tensor<fp16, [1, 128, 384]> input_tensor_15_cast_fp16 = add(x = first_7_cast_fp16, y = second_7_to_fp16)[name = tensor<string, []>("input_tensor_15_cast_fp16")];
            tensor<bool, []> var_1025 = const()[name = tensor<string, []>("op_1025"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1027 = const()[name = tensor<string, []>("op_1027"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_9_cast_fp16 = reduce_mean(axes = var_1027, keep_dims = var_1025, x = input_tensor_15_cast_fp16)[name = tensor<string, []>("second_9_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_17_cast_fp16 = sub(x = input_tensor_15_cast_fp16, y = second_9_cast_fp16)[name = tensor<string, []>("input_tensor_17_cast_fp16")];
            tensor<fp16, []> embeddings_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("embeddings_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 384]> input_tensor_19_cast_fp16 = pow(x = input_tensor_17_cast_fp16, y = embeddings_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_19_cast_fp16")];
            tensor<bool, []> var_1033 = const()[name = tensor<string, []>("op_1033"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1035 = const()[name = tensor<string, []>("op_1035"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_9_cast_fp16 = reduce_mean(axes = var_1035, keep_dims = var_1033, x = input_tensor_19_cast_fp16)[name = tensor<string, []>("first_9_cast_fp16")];
            tensor<fp16, []> embeddings_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("embeddings_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_21_cast_fp16 = add(x = first_9_cast_fp16, y = embeddings_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_21_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_13_cast_fp16 = sqrt(x = input_tensor_21_cast_fp16)[name = tensor<string, []>("second_13_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_11_cast_fp16 = real_div(x = input_tensor_17_cast_fp16, y = second_13_cast_fp16)[name = tensor<string, []>("first_11_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_3_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_3_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23540992)))];
            tensor<fp16, [1, 128, 384]> first_13_cast_fp16 = mul(x = first_11_cast_fp16, y = initializers_onnx_initializer_3_to_fp16)[name = tensor<string, []>("first_13_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_4_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_4_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23541824)))];
            tensor<fp16, [1, 128, 384]> x_3_cast_fp16 = add(x = first_13_cast_fp16, y = initializers_onnx_initializer_4_to_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_45_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_45_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23542656)))];
            tensor<fp16, [384]> input_tensor_45_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_45_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23837632)))];
            tensor<fp16, [1, 128, 384]> input_tensor_45_cast_fp16 = linear(bias = input_tensor_45_bias_0_to_fp16, weight = input_tensor_45_weight_0_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_45_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_23_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_23_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23838464)))];
            tensor<fp16, [384]> input_tensor_23_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_23_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24133440)))];
            tensor<fp16, [1, 128, 384]> input_tensor_23_cast_fp16 = linear(bias = input_tensor_23_bias_0_to_fp16, weight = input_tensor_23_weight_0_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_23_cast_fp16")];
            tensor<int32, [4]> var_1095 = const()[name = tensor<string, []>("op_1095"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_57_cast_fp16 = reshape(shape = var_1095, x = input_tensor_23_cast_fp16)[name = tensor<string, []>("input_tensor_57_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_33_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_33_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24134272)))];
            tensor<fp16, [384]> input_tensor_33_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_33_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24429248)))];
            tensor<fp16, [1, 128, 384]> input_tensor_33_cast_fp16 = linear(bias = input_tensor_33_bias_0_to_fp16, weight = input_tensor_33_weight_0_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_33_cast_fp16")];
            tensor<int32, [4]> var_1145 = const()[name = tensor<string, []>("op_1145"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_43_cast_fp16 = reshape(shape = var_1145, x = input_tensor_33_cast_fp16)[name = tensor<string, []>("input_tensor_43_cast_fp16")];
            tensor<int32, [4]> var_1151 = const()[name = tensor<string, []>("op_1151"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_1198 = const()[name = tensor<string, []>("op_1198"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_55_cast_fp16 = reshape(shape = var_1198, x = input_tensor_45_cast_fp16)[name = tensor<string, []>("input_tensor_55_cast_fp16")];
            tensor<bool, []> first_21_transpose_x_0 = const()[name = tensor<string, []>("first_21_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_21_transpose_y_0 = const()[name = tensor<string, []>("first_21_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_120_perm_0 = const()[name = tensor<string, []>("transpose_120_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_121_perm_0 = const()[name = tensor<string, []>("transpose_121_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 128]> transpose_189 = transpose(perm = transpose_121_perm_0, x = input_tensor_57_cast_fp16)[name = tensor<string, []>("transpose_189")];
            tensor<fp16, [1, 12, 128, 32]> transpose_190 = transpose(perm = transpose_120_perm_0, x = input_tensor_55_cast_fp16)[name = tensor<string, []>("transpose_190")];
            tensor<fp16, [1, 12, 128, 128]> first_21_cast_fp16 = matmul(transpose_x = first_21_transpose_x_0, transpose_y = first_21_transpose_y_0, x = transpose_190, y = transpose_189)[name = tensor<string, []>("first_21_cast_fp16")];
            tensor<fp16, []> _inversed_first_23_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_23_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 128, 128]> _inversed_first_23_cast_fp16 = mul(x = first_21_cast_fp16, y = _inversed_first_23_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_23_cast_fp16")];
            tensor<fp16, [1, 12, 128, 128]> input_tensor_59_cast_fp16 = add(x = _inversed_first_23_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("input_tensor_59_cast_fp16")];
            tensor<int32, []> var_1217 = const()[name = tensor<string, []>("op_1217"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 128, 128]> result_1_cast_fp16 = softmax(axis = var_1217, x = input_tensor_59_cast_fp16)[name = tensor<string, []>("result_1_cast_fp16")];
            tensor<bool, []> input_tensor_63_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_63_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_63_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_63_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 128, 32]> transpose_191 = transpose(perm = var_1151, x = input_tensor_43_cast_fp16)[name = tensor<string, []>("transpose_191")];
            tensor<fp16, [1, 12, 128, 32]> input_tensor_63_cast_fp16 = matmul(transpose_x = input_tensor_63_transpose_x_0, transpose_y = input_tensor_63_transpose_y_0, x = result_1_cast_fp16, y = transpose_191)[name = tensor<string, []>("input_tensor_63_cast_fp16")];
            tensor<int32, [4]> var_1235 = const()[name = tensor<string, []>("op_1235"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_1280 = const()[name = tensor<string, []>("op_1280"), val = tensor<int32, [3]>([1, 128, 384])];
            tensor<fp16, [1, 128, 12, 32]> transpose_188 = transpose(perm = var_1235, x = input_tensor_63_cast_fp16)[name = tensor<string, []>("transpose_188")];
            tensor<fp16, [1, 128, 384]> x_9_cast_fp16 = reshape(shape = var_1280, x = transpose_188)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, [384, 384]> first_27_weight_0_to_fp16 = const()[name = tensor<string, []>("first_27_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24430080)))];
            tensor<fp16, [384]> first_27_bias_0_to_fp16 = const()[name = tensor<string, []>("first_27_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24725056)))];
            tensor<fp16, [1, 128, 384]> first_27_cast_fp16 = linear(bias = first_27_bias_0_to_fp16, weight = first_27_weight_0_to_fp16, x = x_9_cast_fp16)[name = tensor<string, []>("first_27_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_75_cast_fp16 = add(x = first_27_cast_fp16, y = x_3_cast_fp16)[name = tensor<string, []>("input_tensor_75_cast_fp16")];
            tensor<bool, []> var_1288 = const()[name = tensor<string, []>("op_1288"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1290 = const()[name = tensor<string, []>("op_1290"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_31_cast_fp16 = reduce_mean(axes = var_1290, keep_dims = var_1288, x = input_tensor_75_cast_fp16)[name = tensor<string, []>("second_31_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_77_cast_fp16 = sub(x = input_tensor_75_cast_fp16, y = second_31_cast_fp16)[name = tensor<string, []>("input_tensor_77_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_attention_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 384]> input_tensor_79_cast_fp16 = pow(x = input_tensor_77_cast_fp16, y = encoder_layer_0_attention_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_79_cast_fp16")];
            tensor<bool, []> var_1296 = const()[name = tensor<string, []>("op_1296"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1298 = const()[name = tensor<string, []>("op_1298"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_29_cast_fp16 = reduce_mean(axes = var_1298, keep_dims = var_1296, x = input_tensor_79_cast_fp16)[name = tensor<string, []>("first_29_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_attention_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_attention_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_81_cast_fp16 = add(x = first_29_cast_fp16, y = encoder_layer_0_attention_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_81_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_35_cast_fp16 = sqrt(x = input_tensor_81_cast_fp16)[name = tensor<string, []>("second_35_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_31_cast_fp16 = real_div(x = input_tensor_77_cast_fp16, y = second_35_cast_fp16)[name = tensor<string, []>("first_31_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_13_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_13_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24725888)))];
            tensor<fp16, [1, 128, 384]> first_33_cast_fp16 = mul(x = first_31_cast_fp16, y = initializers_onnx_initializer_13_to_fp16)[name = tensor<string, []>("first_33_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_14_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_14_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24726720)))];
            tensor<fp16, [1, 128, 384]> x_11_cast_fp16 = add(x = first_33_cast_fp16, y = initializers_onnx_initializer_14_to_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [1536, 384]> first_37_weight_0_to_fp16 = const()[name = tensor<string, []>("first_37_weight_0_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24727552)))];
            tensor<fp16, [1536]> first_37_bias_0_to_fp16 = const()[name = tensor<string, []>("first_37_bias_0_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25907264)))];
            tensor<fp16, [1, 128, 1536]> first_37_cast_fp16 = linear(bias = first_37_bias_0_to_fp16, weight = first_37_weight_0_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("first_37_cast_fp16")];
            tensor<string, []> x_13_mode_0 = const()[name = tensor<string, []>("x_13_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 1536]> x_13_cast_fp16 = gelu(mode = x_13_mode_0, x = first_37_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<fp16, [384, 1536]> first_45_weight_0_to_fp16 = const()[name = tensor<string, []>("first_45_weight_0_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25910400)))];
            tensor<fp16, [384]> first_45_bias_0_to_fp16 = const()[name = tensor<string, []>("first_45_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27090112)))];
            tensor<fp16, [1, 128, 384]> first_45_cast_fp16 = linear(bias = first_45_bias_0_to_fp16, weight = first_45_weight_0_to_fp16, x = x_13_cast_fp16)[name = tensor<string, []>("first_45_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_85_cast_fp16 = add(x = first_45_cast_fp16, y = x_11_cast_fp16)[name = tensor<string, []>("input_tensor_85_cast_fp16")];
            tensor<bool, []> var_1322 = const()[name = tensor<string, []>("op_1322"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1324 = const()[name = tensor<string, []>("op_1324"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_53_cast_fp16 = reduce_mean(axes = var_1324, keep_dims = var_1322, x = input_tensor_85_cast_fp16)[name = tensor<string, []>("second_53_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_87_cast_fp16 = sub(x = input_tensor_85_cast_fp16, y = second_53_cast_fp16)[name = tensor<string, []>("input_tensor_87_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 384]> input_tensor_89_cast_fp16 = pow(x = input_tensor_87_cast_fp16, y = encoder_layer_0_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_89_cast_fp16")];
            tensor<bool, []> var_1330 = const()[name = tensor<string, []>("op_1330"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1332 = const()[name = tensor<string, []>("op_1332"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_47_cast_fp16 = reduce_mean(axes = var_1332, keep_dims = var_1330, x = input_tensor_89_cast_fp16)[name = tensor<string, []>("first_47_cast_fp16")];
            tensor<fp16, []> encoder_layer_0_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_0_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_91_cast_fp16 = add(x = first_47_cast_fp16, y = encoder_layer_0_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_91_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_57_cast_fp16 = sqrt(x = input_tensor_91_cast_fp16)[name = tensor<string, []>("second_57_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_49_cast_fp16 = real_div(x = input_tensor_87_cast_fp16, y = second_57_cast_fp16)[name = tensor<string, []>("first_49_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_19_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_19_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27090944)))];
            tensor<fp16, [1, 128, 384]> first_51_cast_fp16 = mul(x = first_49_cast_fp16, y = initializers_onnx_initializer_19_to_fp16)[name = tensor<string, []>("first_51_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_20_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_20_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27091776)))];
            tensor<fp16, [1, 128, 384]> x_15_cast_fp16 = add(x = first_51_cast_fp16, y = initializers_onnx_initializer_20_to_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_115_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_115_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27092608)))];
            tensor<fp16, [384]> input_tensor_115_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_115_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27387584)))];
            tensor<fp16, [1, 128, 384]> input_tensor_115_cast_fp16 = linear(bias = input_tensor_115_bias_0_to_fp16, weight = input_tensor_115_weight_0_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_115_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_93_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_93_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27388416)))];
            tensor<fp16, [384]> input_tensor_93_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_93_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27683392)))];
            tensor<fp16, [1, 128, 384]> input_tensor_93_cast_fp16 = linear(bias = input_tensor_93_bias_0_to_fp16, weight = input_tensor_93_weight_0_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_93_cast_fp16")];
            tensor<int32, [4]> var_1392 = const()[name = tensor<string, []>("op_1392"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_127_cast_fp16 = reshape(shape = var_1392, x = input_tensor_93_cast_fp16)[name = tensor<string, []>("input_tensor_127_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_103_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_103_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27684224)))];
            tensor<fp16, [384]> input_tensor_103_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_103_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27979200)))];
            tensor<fp16, [1, 128, 384]> input_tensor_103_cast_fp16 = linear(bias = input_tensor_103_bias_0_to_fp16, weight = input_tensor_103_weight_0_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_103_cast_fp16")];
            tensor<int32, [4]> var_1442 = const()[name = tensor<string, []>("op_1442"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_113_cast_fp16 = reshape(shape = var_1442, x = input_tensor_103_cast_fp16)[name = tensor<string, []>("input_tensor_113_cast_fp16")];
            tensor<int32, [4]> var_1448 = const()[name = tensor<string, []>("op_1448"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_1495 = const()[name = tensor<string, []>("op_1495"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_125_cast_fp16 = reshape(shape = var_1495, x = input_tensor_115_cast_fp16)[name = tensor<string, []>("input_tensor_125_cast_fp16")];
            tensor<bool, []> first_59_transpose_x_0 = const()[name = tensor<string, []>("first_59_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_59_transpose_y_0 = const()[name = tensor<string, []>("first_59_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_122_perm_0 = const()[name = tensor<string, []>("transpose_122_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_123_perm_0 = const()[name = tensor<string, []>("transpose_123_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 128]> transpose_185 = transpose(perm = transpose_123_perm_0, x = input_tensor_127_cast_fp16)[name = tensor<string, []>("transpose_185")];
            tensor<fp16, [1, 12, 128, 32]> transpose_186 = transpose(perm = transpose_122_perm_0, x = input_tensor_125_cast_fp16)[name = tensor<string, []>("transpose_186")];
            tensor<fp16, [1, 12, 128, 128]> first_59_cast_fp16 = matmul(transpose_x = first_59_transpose_x_0, transpose_y = first_59_transpose_y_0, x = transpose_186, y = transpose_185)[name = tensor<string, []>("first_59_cast_fp16")];
            tensor<fp16, []> _inversed_first_61_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_61_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 128, 128]> _inversed_first_61_cast_fp16 = mul(x = first_59_cast_fp16, y = _inversed_first_61_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_61_cast_fp16")];
            tensor<fp16, [1, 12, 128, 128]> input_tensor_129_cast_fp16 = add(x = _inversed_first_61_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("input_tensor_129_cast_fp16")];
            tensor<int32, []> var_1514 = const()[name = tensor<string, []>("op_1514"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 128, 128]> result_3_cast_fp16 = softmax(axis = var_1514, x = input_tensor_129_cast_fp16)[name = tensor<string, []>("result_3_cast_fp16")];
            tensor<bool, []> input_tensor_133_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_133_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_133_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_133_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 128, 32]> transpose_187 = transpose(perm = var_1448, x = input_tensor_113_cast_fp16)[name = tensor<string, []>("transpose_187")];
            tensor<fp16, [1, 12, 128, 32]> input_tensor_133_cast_fp16 = matmul(transpose_x = input_tensor_133_transpose_x_0, transpose_y = input_tensor_133_transpose_y_0, x = result_3_cast_fp16, y = transpose_187)[name = tensor<string, []>("input_tensor_133_cast_fp16")];
            tensor<int32, [4]> var_1532 = const()[name = tensor<string, []>("op_1532"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_1577 = const()[name = tensor<string, []>("op_1577"), val = tensor<int32, [3]>([1, 128, 384])];
            tensor<fp16, [1, 128, 12, 32]> transpose_184 = transpose(perm = var_1532, x = input_tensor_133_cast_fp16)[name = tensor<string, []>("transpose_184")];
            tensor<fp16, [1, 128, 384]> x_21_cast_fp16 = reshape(shape = var_1577, x = transpose_184)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [384, 384]> first_65_weight_0_to_fp16 = const()[name = tensor<string, []>("first_65_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27980032)))];
            tensor<fp16, [384]> first_65_bias_0_to_fp16 = const()[name = tensor<string, []>("first_65_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28275008)))];
            tensor<fp16, [1, 128, 384]> first_65_cast_fp16 = linear(bias = first_65_bias_0_to_fp16, weight = first_65_weight_0_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("first_65_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_145_cast_fp16 = add(x = first_65_cast_fp16, y = x_15_cast_fp16)[name = tensor<string, []>("input_tensor_145_cast_fp16")];
            tensor<bool, []> var_1585 = const()[name = tensor<string, []>("op_1585"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1587 = const()[name = tensor<string, []>("op_1587"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_73_cast_fp16 = reduce_mean(axes = var_1587, keep_dims = var_1585, x = input_tensor_145_cast_fp16)[name = tensor<string, []>("second_73_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_147_cast_fp16 = sub(x = input_tensor_145_cast_fp16, y = second_73_cast_fp16)[name = tensor<string, []>("input_tensor_147_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_attention_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 384]> input_tensor_149_cast_fp16 = pow(x = input_tensor_147_cast_fp16, y = encoder_layer_1_attention_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_149_cast_fp16")];
            tensor<bool, []> var_1593 = const()[name = tensor<string, []>("op_1593"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1595 = const()[name = tensor<string, []>("op_1595"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_67_cast_fp16 = reduce_mean(axes = var_1595, keep_dims = var_1593, x = input_tensor_149_cast_fp16)[name = tensor<string, []>("first_67_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_attention_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_attention_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_151_cast_fp16 = add(x = first_67_cast_fp16, y = encoder_layer_1_attention_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_151_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_77_cast_fp16 = sqrt(x = input_tensor_151_cast_fp16)[name = tensor<string, []>("second_77_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_69_cast_fp16 = real_div(x = input_tensor_147_cast_fp16, y = second_77_cast_fp16)[name = tensor<string, []>("first_69_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_29_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_29_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28275840)))];
            tensor<fp16, [1, 128, 384]> first_71_cast_fp16 = mul(x = first_69_cast_fp16, y = initializers_onnx_initializer_29_to_fp16)[name = tensor<string, []>("first_71_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_30_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_30_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28276672)))];
            tensor<fp16, [1, 128, 384]> x_23_cast_fp16 = add(x = first_71_cast_fp16, y = initializers_onnx_initializer_30_to_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<fp16, [1536, 384]> first_75_weight_0_to_fp16 = const()[name = tensor<string, []>("first_75_weight_0_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28277504)))];
            tensor<fp16, [1536]> first_75_bias_0_to_fp16 = const()[name = tensor<string, []>("first_75_bias_0_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29457216)))];
            tensor<fp16, [1, 128, 1536]> first_75_cast_fp16 = linear(bias = first_75_bias_0_to_fp16, weight = first_75_weight_0_to_fp16, x = x_23_cast_fp16)[name = tensor<string, []>("first_75_cast_fp16")];
            tensor<string, []> x_25_mode_0 = const()[name = tensor<string, []>("x_25_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 1536]> x_25_cast_fp16 = gelu(mode = x_25_mode_0, x = first_75_cast_fp16)[name = tensor<string, []>("x_25_cast_fp16")];
            tensor<fp16, [384, 1536]> first_83_weight_0_to_fp16 = const()[name = tensor<string, []>("first_83_weight_0_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29460352)))];
            tensor<fp16, [384]> first_83_bias_0_to_fp16 = const()[name = tensor<string, []>("first_83_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30640064)))];
            tensor<fp16, [1, 128, 384]> first_83_cast_fp16 = linear(bias = first_83_bias_0_to_fp16, weight = first_83_weight_0_to_fp16, x = x_25_cast_fp16)[name = tensor<string, []>("first_83_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_155_cast_fp16 = add(x = first_83_cast_fp16, y = x_23_cast_fp16)[name = tensor<string, []>("input_tensor_155_cast_fp16")];
            tensor<bool, []> var_1619 = const()[name = tensor<string, []>("op_1619"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1621 = const()[name = tensor<string, []>("op_1621"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_95_cast_fp16 = reduce_mean(axes = var_1621, keep_dims = var_1619, x = input_tensor_155_cast_fp16)[name = tensor<string, []>("second_95_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_157_cast_fp16 = sub(x = input_tensor_155_cast_fp16, y = second_95_cast_fp16)[name = tensor<string, []>("input_tensor_157_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 384]> input_tensor_159_cast_fp16 = pow(x = input_tensor_157_cast_fp16, y = encoder_layer_1_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_159_cast_fp16")];
            tensor<bool, []> var_1627 = const()[name = tensor<string, []>("op_1627"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1629 = const()[name = tensor<string, []>("op_1629"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_85_cast_fp16 = reduce_mean(axes = var_1629, keep_dims = var_1627, x = input_tensor_159_cast_fp16)[name = tensor<string, []>("first_85_cast_fp16")];
            tensor<fp16, []> encoder_layer_1_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_1_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_161_cast_fp16 = add(x = first_85_cast_fp16, y = encoder_layer_1_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_161_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_99_cast_fp16 = sqrt(x = input_tensor_161_cast_fp16)[name = tensor<string, []>("second_99_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_87_cast_fp16 = real_div(x = input_tensor_157_cast_fp16, y = second_99_cast_fp16)[name = tensor<string, []>("first_87_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_35_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_35_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30640896)))];
            tensor<fp16, [1, 128, 384]> first_89_cast_fp16 = mul(x = first_87_cast_fp16, y = initializers_onnx_initializer_35_to_fp16)[name = tensor<string, []>("first_89_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_36_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_36_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30641728)))];
            tensor<fp16, [1, 128, 384]> x_27_cast_fp16 = add(x = first_89_cast_fp16, y = initializers_onnx_initializer_36_to_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_185_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_185_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30642560)))];
            tensor<fp16, [384]> input_tensor_185_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_185_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30937536)))];
            tensor<fp16, [1, 128, 384]> input_tensor_185_cast_fp16 = linear(bias = input_tensor_185_bias_0_to_fp16, weight = input_tensor_185_weight_0_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_185_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_163_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_163_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30938368)))];
            tensor<fp16, [384]> input_tensor_163_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_163_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31233344)))];
            tensor<fp16, [1, 128, 384]> input_tensor_163_cast_fp16 = linear(bias = input_tensor_163_bias_0_to_fp16, weight = input_tensor_163_weight_0_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_163_cast_fp16")];
            tensor<int32, [4]> var_1689 = const()[name = tensor<string, []>("op_1689"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_197_cast_fp16 = reshape(shape = var_1689, x = input_tensor_163_cast_fp16)[name = tensor<string, []>("input_tensor_197_cast_fp16")];
            tensor<fp16, [384, 384]> input_tensor_173_weight_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_173_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31234176)))];
            tensor<fp16, [384]> input_tensor_173_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_173_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31529152)))];
            tensor<fp16, [1, 128, 384]> input_tensor_173_cast_fp16 = linear(bias = input_tensor_173_bias_0_to_fp16, weight = input_tensor_173_weight_0_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_173_cast_fp16")];
            tensor<int32, [4]> var_1739 = const()[name = tensor<string, []>("op_1739"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_183_cast_fp16 = reshape(shape = var_1739, x = input_tensor_173_cast_fp16)[name = tensor<string, []>("input_tensor_183_cast_fp16")];
            tensor<int32, [4]> var_1745 = const()[name = tensor<string, []>("op_1745"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_1792 = const()[name = tensor<string, []>("op_1792"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_195_cast_fp16 = reshape(shape = var_1792, x = input_tensor_185_cast_fp16)[name = tensor<string, []>("input_tensor_195_cast_fp16")];
            tensor<bool, []> first_97_transpose_x_0 = const()[name = tensor<string, []>("first_97_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_97_transpose_y_0 = const()[name = tensor<string, []>("first_97_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_124_perm_0 = const()[name = tensor<string, []>("transpose_124_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_125_perm_0 = const()[name = tensor<string, []>("transpose_125_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 32, 128]> transpose_181 = transpose(perm = transpose_125_perm_0, x = input_tensor_197_cast_fp16)[name = tensor<string, []>("transpose_181")];
            tensor<fp16, [1, 12, 128, 32]> transpose_182 = transpose(perm = transpose_124_perm_0, x = input_tensor_195_cast_fp16)[name = tensor<string, []>("transpose_182")];
            tensor<fp16, [1, 12, 128, 128]> first_97_cast_fp16 = matmul(transpose_x = first_97_transpose_x_0, transpose_y = first_97_transpose_y_0, x = transpose_182, y = transpose_181)[name = tensor<string, []>("first_97_cast_fp16")];
            tensor<fp16, []> _inversed_first_99_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_99_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, 12, 128, 128]> _inversed_first_99_cast_fp16 = mul(x = first_97_cast_fp16, y = _inversed_first_99_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_99_cast_fp16")];
            tensor<fp16, [1, 12, 128, 128]> input_tensor_199_cast_fp16 = add(x = _inversed_first_99_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("input_tensor_199_cast_fp16")];
            tensor<int32, []> var_1811 = const()[name = tensor<string, []>("op_1811"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 128, 128]> result_5_cast_fp16 = softmax(axis = var_1811, x = input_tensor_199_cast_fp16)[name = tensor<string, []>("result_5_cast_fp16")];
            tensor<bool, []> input_tensor_203_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_203_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_203_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_203_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 128, 32]> transpose_183 = transpose(perm = var_1745, x = input_tensor_183_cast_fp16)[name = tensor<string, []>("transpose_183")];
            tensor<fp16, [1, 12, 128, 32]> input_tensor_203_cast_fp16 = matmul(transpose_x = input_tensor_203_transpose_x_0, transpose_y = input_tensor_203_transpose_y_0, x = result_5_cast_fp16, y = transpose_183)[name = tensor<string, []>("input_tensor_203_cast_fp16")];
            tensor<int32, [4]> var_1829 = const()[name = tensor<string, []>("op_1829"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_1874 = const()[name = tensor<string, []>("op_1874"), val = tensor<int32, [3]>([1, 128, 384])];
            tensor<fp16, [1, 128, 12, 32]> transpose_180 = transpose(perm = var_1829, x = input_tensor_203_cast_fp16)[name = tensor<string, []>("transpose_180")];
            tensor<fp16, [1, 128, 384]> x_33_cast_fp16 = reshape(shape = var_1874, x = transpose_180)[name = tensor<string, []>("x_33_cast_fp16")];
            tensor<fp16, [384, 384]> first_103_weight_0_to_fp16 = const()[name = tensor<string, []>("first_103_weight_0_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31529984)))];
            tensor<fp16, [384]> first_103_bias_0_to_fp16 = const()[name = tensor<string, []>("first_103_bias_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31824960)))];
            tensor<fp16, [1, 128, 384]> first_103_cast_fp16 = linear(bias = first_103_bias_0_to_fp16, weight = first_103_weight_0_to_fp16, x = x_33_cast_fp16)[name = tensor<string, []>("first_103_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_215_cast_fp16 = add(x = first_103_cast_fp16, y = x_27_cast_fp16)[name = tensor<string, []>("input_tensor_215_cast_fp16")];
            tensor<bool, []> var_1882 = const()[name = tensor<string, []>("op_1882"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1884 = const()[name = tensor<string, []>("op_1884"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_115_cast_fp16 = reduce_mean(axes = var_1884, keep_dims = var_1882, x = input_tensor_215_cast_fp16)[name = tensor<string, []>("second_115_cast_fp16")];
            tensor<fp16, [1, 128, 384]> input_tensor_217_cast_fp16 = sub(x = input_tensor_215_cast_fp16, y = second_115_cast_fp16)[name = tensor<string, []>("input_tensor_217_cast_fp16")];
            tensor<fp16, []> encoder_layer_2_attention_output_LayerNorm_Constant_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_LayerNorm_Constant_value_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 384]> input_tensor_219_cast_fp16 = pow(x = input_tensor_217_cast_fp16, y = encoder_layer_2_attention_output_LayerNorm_Constant_value_to_fp16)[name = tensor<string, []>("input_tensor_219_cast_fp16")];
            tensor<bool, []> var_1890 = const()[name = tensor<string, []>("op_1890"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1892 = const()[name = tensor<string, []>("op_1892"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_105_cast_fp16 = reduce_mean(axes = var_1892, keep_dims = var_1890, x = input_tensor_219_cast_fp16)[name = tensor<string, []>("first_105_cast_fp16")];
            tensor<fp16, []> encoder_layer_2_attention_output_LayerNorm_Constant_1_value_to_fp16 = const()[name = tensor<string, []>("encoder_layer_2_attention_output_LayerNorm_Constant_1_value_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_221_cast_fp16 = add(x = first_105_cast_fp16, y = encoder_layer_2_attention_output_LayerNorm_Constant_1_value_to_fp16)[name = tensor<string, []>("input_tensor_221_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_119_cast_fp16 = sqrt(x = input_tensor_221_cast_fp16)[name = tensor<string, []>("second_119_cast_fp16")];
            tensor<fp16, [1, 128, 384]> first_107_cast_fp16 = real_div(x = input_tensor_217_cast_fp16, y = second_119_cast_fp16)[name = tensor<string, []>("first_107_cast_fp16")];
            tensor<fp16, [384]> initializers_onnx_initializer_45_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_45_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31825792)))];
            tensor<fp16, [1, 128, 384]> first_109_cast_fp16 = mul(x = first_107_cast_fp16, y = initializers_onnx_initializer_45_to_fp16)[name = tensor<string, []>("first_109_cast_fp16")];
