program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2"}})]
{
    func main<ios15>(tensor<int32, [1, 128]> attention_mask, tensor<int32, [1, 128]> input_ids, tensor<int32, [1, 128]> token_type_ids) {
            tensor<int32, []> first_1_axis_0 = const()[name = tensor<string, []>("first_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [30528, 768]> initializers_onnx_initializer_0_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_0_to_fp16"), val = tensor<fp16, [30528, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 128, 768]> first_1_cast_fp16 = gather(axis = first_1_axis_0, indices = input_ids, x = initializers_onnx_initializer_0_to_fp16)[name = tensor<string, []>("first_1_cast_fp16")];
            tensor<int32, []> second_1_axis_0 = const()[name = tensor<string, []>("second_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2, 768]> initializers_onnx_initializer_1_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_1_to_fp16"), val = tensor<fp16, [2, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46891136)))];
            tensor<fp16, [1, 128, 768]> second_1_cast_fp16 = gather(axis = second_1_axis_0, indices = attention_mask, x = initializers_onnx_initializer_1_to_fp16)[name = tensor<string, []>("second_1_cast_fp16")];
            tensor<int32, [1]> result_axes_0 = const()[name = tensor<string, []>("result_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1, 1, 128]> result = expand_dims(axes = result_axes_0, x = token_type_ids)[name = tensor<string, []>("result")];
            tensor<int32, [1]> input_tensor_5_axes_0 = const()[name = tensor<string, []>("input_tensor_5_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1, 1, 1, 128]> input_tensor_5 = expand_dims(axes = input_tensor_5_axes_0, x = result)[name = tensor<string, []>("input_tensor_5")];
            tensor<fp16, [1, 128, 768]> input_tensor_7_cast_fp16 = add(x = first_1_cast_fp16, y = second_1_cast_fp16)[name = tensor<string, []>("input_tensor_7_cast_fp16")];
            tensor<bool, []> var_1459 = const()[name = tensor<string, []>("op_1459"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1461 = const()[name = tensor<string, []>("op_1461"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_5_cast_fp16 = reduce_mean(axes = var_1461, keep_dims = var_1459, x = input_tensor_7_cast_fp16)[name = tensor<string, []>("second_5_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_2_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_2_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<string, []> second_3_to_fp16_dtype_0 = const()[name = tensor<string, []>("second_3_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, 128]> cast_147 = cast(dtype = second_3_to_fp16_dtype_0, x = input_tensor_5)[name = tensor<string, []>("cast_147")];
            tensor<fp16, [1, 1, 1, 128]> first_5_cast_fp16 = sub(x = initializers_onnx_initializer_2_to_fp16, y = cast_147)[name = tensor<string, []>("first_5_cast_fp16")];
            tensor<fp16, [1, 128, 768]> input_tensor_9_cast_fp16 = sub(x = input_tensor_7_cast_fp16, y = second_5_cast_fp16)[name = tensor<string, []>("input_tensor_9_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_3_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_3_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [1, 1, 1, 128]> second_31_cast_fp16 = mul(x = first_5_cast_fp16, y = initializers_onnx_initializer_3_to_fp16)[name = tensor<string, []>("second_31_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_4_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_4_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 768]> input_tensor_11_cast_fp16 = pow(x = input_tensor_9_cast_fp16, y = initializers_onnx_initializer_4_to_fp16)[name = tensor<string, []>("input_tensor_11_cast_fp16")];
            tensor<bool, []> var_1470 = const()[name = tensor<string, []>("op_1470"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1472 = const()[name = tensor<string, []>("op_1472"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_7_cast_fp16 = reduce_mean(axes = var_1472, keep_dims = var_1470, x = input_tensor_11_cast_fp16)[name = tensor<string, []>("first_7_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_5_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_5_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_13_cast_fp16 = add(x = first_7_cast_fp16, y = initializers_onnx_initializer_5_to_fp16)[name = tensor<string, []>("input_tensor_13_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_11_cast_fp16 = sqrt(x = input_tensor_13_cast_fp16)[name = tensor<string, []>("second_11_cast_fp16")];
            tensor<fp16, [1, 128, 768]> first_9_cast_fp16 = real_div(x = input_tensor_9_cast_fp16, y = second_11_cast_fp16)[name = tensor<string, []>("first_9_cast_fp16")];
            tensor<fp16, [768]> initializers_onnx_initializer_6_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_6_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46894272)))];
            tensor<fp16, [1, 128, 768]> first_11_cast_fp16 = mul(x = first_9_cast_fp16, y = initializers_onnx_initializer_6_to_fp16)[name = tensor<string, []>("first_11_cast_fp16")];
            tensor<fp16, [768]> initializers_onnx_initializer_7_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_7_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46895872)))];
            tensor<fp16, [1, 128, 768]> x_1_cast_fp16 = add(x = first_11_cast_fp16, y = initializers_onnx_initializer_7_to_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<fp16, [2304, 768]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [2304, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46897472)))];
            tensor<fp16, [2304]> input_tensor_15_bias_0_to_fp16 = const()[name = tensor<string, []>("input_tensor_15_bias_0_to_fp16"), val = tensor<fp16, [2304]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50436480)))];
            tensor<fp16, [1, 128, 2304]> input_tensor_15_cast_fp16 = linear(bias = input_tensor_15_bias_0_to_fp16, weight = transpose_0_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("input_tensor_15_cast_fp16")];
            tensor<int32, [5]> var_1522 = const()[name = tensor<string, []>("op_1522"), val = tensor<int32, [5]>([1, 128, 3, 12, 64])];
            tensor<fp16, [1, 128, 3, 12, 64]> input_tensor_23_cast_fp16 = reshape(shape = var_1522, x = input_tensor_15_cast_fp16)[name = tensor<string, []>("input_tensor_23_cast_fp16")];
            tensor<int32, [5]> input_tensor_27_begin_0 = const()[name = tensor<string, []>("input_tensor_27_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> input_tensor_27_end_0 = const()[name = tensor<string, []>("input_tensor_27_end_0"), val = tensor<int32, [5]>([1, 128, 1, 12, 64])];
            tensor<bool, [5]> input_tensor_27_end_mask_0 = const()[name = tensor<string, []>("input_tensor_27_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_27_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_27_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_27_cast_fp16 = slice_by_index(begin = input_tensor_27_begin_0, end = input_tensor_27_end_0, end_mask = input_tensor_27_end_mask_0, squeeze_mask = input_tensor_27_squeeze_mask_0, x = input_tensor_23_cast_fp16)[name = tensor<string, []>("input_tensor_27_cast_fp16")];
            tensor<int32, [5]> input_tensor_29_begin_0 = const()[name = tensor<string, []>("input_tensor_29_begin_0"), val = tensor<int32, [5]>([0, 0, 1, 0, 0])];
            tensor<int32, [5]> input_tensor_29_end_0 = const()[name = tensor<string, []>("input_tensor_29_end_0"), val = tensor<int32, [5]>([1, 128, 2, 12, 64])];
            tensor<bool, [5]> input_tensor_29_end_mask_0 = const()[name = tensor<string, []>("input_tensor_29_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_29_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_29_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_29_cast_fp16 = slice_by_index(begin = input_tensor_29_begin_0, end = input_tensor_29_end_0, end_mask = input_tensor_29_end_mask_0, squeeze_mask = input_tensor_29_squeeze_mask_0, x = input_tensor_23_cast_fp16)[name = tensor<string, []>("input_tensor_29_cast_fp16")];
            tensor<int32, [5]> input_tensor_31_begin_0 = const()[name = tensor<string, []>("input_tensor_31_begin_0"), val = tensor<int32, [5]>([0, 0, 2, 0, 0])];
            tensor<int32, [5]> input_tensor_31_end_0 = const()[name = tensor<string, []>("input_tensor_31_end_0"), val = tensor<int32, [5]>([1, 128, 3, 12, 64])];
            tensor<bool, [5]> input_tensor_31_end_mask_0 = const()[name = tensor<string, []>("input_tensor_31_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_31_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_31_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_31_cast_fp16 = slice_by_index(begin = input_tensor_31_begin_0, end = input_tensor_31_end_0, end_mask = input_tensor_31_end_mask_0, squeeze_mask = input_tensor_31_squeeze_mask_0, x = input_tensor_23_cast_fp16)[name = tensor<string, []>("input_tensor_31_cast_fp16")];
            tensor<int32, [1]> var_1575_axes_0 = const()[name = tensor<string, []>("op_1575_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 12, 64]> var_1575_cast_fp16 = expand_dims(axes = var_1575_axes_0, x = input_tensor_31_cast_fp16)[name = tensor<string, []>("op_1575_cast_fp16")];
            tensor<int32, [4]> var_1659_begin_0 = const()[name = tensor<string, []>("op_1659_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_1659_end_0 = const()[name = tensor<string, []>("op_1659_end_0"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<bool, [4]> var_1659_end_mask_0 = const()[name = tensor<string, []>("op_1659_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> var_1659_cast_fp16 = slice_by_index(begin = var_1659_begin_0, end = var_1659_end_0, end_mask = var_1659_end_mask_0, x = input_tensor_27_cast_fp16)[name = tensor<string, []>("op_1659_cast_fp16")];
            tensor<int32, [4]> input_tensor_43_begin_0 = const()[name = tensor<string, []>("input_tensor_43_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 32])];
            tensor<int32, [4]> input_tensor_43_end_0 = const()[name = tensor<string, []>("input_tensor_43_end_0"), val = tensor<int32, [4]>([1, 128, 12, 64])];
            tensor<bool, [4]> input_tensor_43_end_mask_0 = const()[name = tensor<string, []>("input_tensor_43_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_43_cast_fp16 = slice_by_index(begin = input_tensor_43_begin_0, end = input_tensor_43_end_0, end_mask = input_tensor_43_end_mask_0, x = input_tensor_27_cast_fp16)[name = tensor<string, []>("input_tensor_43_cast_fp16")];
            tensor<int32, [4]> var_1679_begin_0 = const()[name = tensor<string, []>("op_1679_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_1679_end_0 = const()[name = tensor<string, []>("op_1679_end_0"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<bool, [4]> var_1679_end_mask_0 = const()[name = tensor<string, []>("op_1679_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> var_1679_cast_fp16 = slice_by_index(begin = var_1679_begin_0, end = var_1679_end_0, end_mask = var_1679_end_mask_0, x = input_tensor_29_cast_fp16)[name = tensor<string, []>("op_1679_cast_fp16")];
            tensor<int32, [4]> input_tensor_45_begin_0 = const()[name = tensor<string, []>("input_tensor_45_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 32])];
            tensor<int32, [4]> input_tensor_45_end_0 = const()[name = tensor<string, []>("input_tensor_45_end_0"), val = tensor<int32, [4]>([1, 128, 12, 64])];
            tensor<bool, [4]> input_tensor_45_end_mask_0 = const()[name = tensor<string, []>("input_tensor_45_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_45_cast_fp16 = slice_by_index(begin = input_tensor_45_begin_0, end = input_tensor_45_end_0, end_mask = input_tensor_45_end_mask_0, x = input_tensor_29_cast_fp16)[name = tensor<string, []>("input_tensor_45_cast_fp16")];
            tensor<fp16, []> const_0_promoted_to_fp16 = const()[name = tensor<string, []>("const_0_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 128, 12, 32]> var_1701_cast_fp16 = mul(x = input_tensor_43_cast_fp16, y = const_0_promoted_to_fp16)[name = tensor<string, []>("op_1701_cast_fp16")];
            tensor<fp16, []> const_1_promoted_to_fp16 = const()[name = tensor<string, []>("const_1_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 128, 12, 32]> var_1702_cast_fp16 = mul(x = input_tensor_45_cast_fp16, y = const_1_promoted_to_fp16)[name = tensor<string, []>("op_1702_cast_fp16")];
            tensor<int32, []> var_1707 = const()[name = tensor<string, []>("op_1707"), val = tensor<int32, []>(-1)];
            tensor<bool, []> first_13_interleave_0 = const()[name = tensor<string, []>("first_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> first_13_cast_fp16 = concat(axis = var_1707, interleave = first_13_interleave_0, values = (var_1701_cast_fp16, var_1659_cast_fp16))[name = tensor<string, []>("first_13_cast_fp16")];
            tensor<int32, []> var_1710 = const()[name = tensor<string, []>("op_1710"), val = tensor<int32, []>(-1)];
            tensor<bool, []> first_15_interleave_0 = const()[name = tensor<string, []>("first_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> first_15_cast_fp16 = concat(axis = var_1710, interleave = first_15_interleave_0, values = (var_1702_cast_fp16, var_1679_cast_fp16))[name = tensor<string, []>("first_15_cast_fp16")];
            tensor<fp16, [128, 1, 64]> second_17_to_fp16 = const()[name = tensor<string, []>("second_17_to_fp16"), val = tensor<fp16, [128, 1, 64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50441152)))];
            tensor<fp16, [1, 128, 12, 64]> first_17_cast_fp16 = mul(x = input_tensor_27_cast_fp16, y = second_17_to_fp16)[name = tensor<string, []>("first_17_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> first_19_cast_fp16 = mul(x = input_tensor_29_cast_fp16, y = second_17_to_fp16)[name = tensor<string, []>("first_19_cast_fp16")];
            tensor<fp16, [128, 1, 64]> second_21_to_fp16 = const()[name = tensor<string, []>("second_21_to_fp16"), val = tensor<fp16, [128, 1, 64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50457600)))];
            tensor<fp16, [1, 128, 12, 64]> second_25_cast_fp16 = mul(x = first_13_cast_fp16, y = second_21_to_fp16)[name = tensor<string, []>("second_25_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> second_27_cast_fp16 = mul(x = first_15_cast_fp16, y = second_21_to_fp16)[name = tensor<string, []>("second_27_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> var_1864_cast_fp16 = add(x = first_17_cast_fp16, y = second_25_cast_fp16)[name = tensor<string, []>("op_1864_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> var_1866_cast_fp16 = add(x = first_19_cast_fp16, y = second_27_cast_fp16)[name = tensor<string, []>("op_1866_cast_fp16")];
            tensor<int32, []> var_1867 = const()[name = tensor<string, []>("op_1867"), val = tensor<int32, []>(-1)];
            tensor<bool, []> input_tensor_73_interleave_0 = const()[name = tensor<string, []>("input_tensor_73_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_73_cast_fp16 = concat(axis = var_1867, interleave = input_tensor_73_interleave_0, values = var_1864_cast_fp16)[name = tensor<string, []>("input_tensor_73_cast_fp16")];
            tensor<int32, []> var_1870 = const()[name = tensor<string, []>("op_1870"), val = tensor<int32, []>(-1)];
            tensor<bool, []> input_tensor_75_interleave_0 = const()[name = tensor<string, []>("input_tensor_75_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_75_cast_fp16 = concat(axis = var_1870, interleave = input_tensor_75_interleave_0, values = var_1866_cast_fp16)[name = tensor<string, []>("input_tensor_75_cast_fp16")];
            tensor<int32, [1]> var_1874_axes_0 = const()[name = tensor<string, []>("op_1874_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 12, 64]> var_1874_cast_fp16 = expand_dims(axes = var_1874_axes_0, x = input_tensor_73_cast_fp16)[name = tensor<string, []>("op_1874_cast_fp16")];
            tensor<int32, [1]> var_1876_axes_0 = const()[name = tensor<string, []>("op_1876_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 12, 64]> var_1876_cast_fp16 = expand_dims(axes = var_1876_axes_0, x = input_tensor_75_cast_fp16)[name = tensor<string, []>("op_1876_cast_fp16")];
            tensor<int32, []> var_1877 = const()[name = tensor<string, []>("op_1877"), val = tensor<int32, []>(2)];
            tensor<bool, []> input_tensor_77_interleave_0 = const()[name = tensor<string, []>("input_tensor_77_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 3, 12, 64]> input_tensor_77_cast_fp16 = concat(axis = var_1877, interleave = input_tensor_77_interleave_0, values = (var_1874_cast_fp16, var_1876_cast_fp16, var_1575_cast_fp16))[name = tensor<string, []>("input_tensor_77_cast_fp16")];
            tensor<int32, [5]> input_tensor_79_begin_0 = const()[name = tensor<string, []>("input_tensor_79_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> input_tensor_79_end_0 = const()[name = tensor<string, []>("input_tensor_79_end_0"), val = tensor<int32, [5]>([1, 128, 1, 12, 64])];
            tensor<bool, [5]> input_tensor_79_end_mask_0 = const()[name = tensor<string, []>("input_tensor_79_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_79_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_79_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_79_cast_fp16 = slice_by_index(begin = input_tensor_79_begin_0, end = input_tensor_79_end_0, end_mask = input_tensor_79_end_mask_0, squeeze_mask = input_tensor_79_squeeze_mask_0, x = input_tensor_77_cast_fp16)[name = tensor<string, []>("input_tensor_79_cast_fp16")];
            tensor<int32, [5]> input_tensor_83_begin_0 = const()[name = tensor<string, []>("input_tensor_83_begin_0"), val = tensor<int32, [5]>([0, 0, 1, 0, 0])];
            tensor<int32, [5]> input_tensor_83_end_0 = const()[name = tensor<string, []>("input_tensor_83_end_0"), val = tensor<int32, [5]>([1, 128, 2, 12, 64])];
            tensor<bool, [5]> input_tensor_83_end_mask_0 = const()[name = tensor<string, []>("input_tensor_83_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_83_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_83_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_83_cast_fp16 = slice_by_index(begin = input_tensor_83_begin_0, end = input_tensor_83_end_0, end_mask = input_tensor_83_end_mask_0, squeeze_mask = input_tensor_83_squeeze_mask_0, x = input_tensor_77_cast_fp16)[name = tensor<string, []>("input_tensor_83_cast_fp16")];
            tensor<int32, [5]> input_tensor_81_begin_0 = const()[name = tensor<string, []>("input_tensor_81_begin_0"), val = tensor<int32, [5]>([0, 0, 2, 0, 0])];
            tensor<int32, [5]> input_tensor_81_end_0 = const()[name = tensor<string, []>("input_tensor_81_end_0"), val = tensor<int32, [5]>([1, 128, 3, 12, 64])];
            tensor<bool, [5]> input_tensor_81_end_mask_0 = const()[name = tensor<string, []>("input_tensor_81_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_81_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_81_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_81_cast_fp16 = slice_by_index(begin = input_tensor_81_begin_0, end = input_tensor_81_end_0, end_mask = input_tensor_81_end_mask_0, squeeze_mask = input_tensor_81_squeeze_mask_0, x = input_tensor_77_cast_fp16)[name = tensor<string, []>("input_tensor_81_cast_fp16")];
            tensor<int32, [4]> var_1926 = const()[name = tensor<string, []>("op_1926"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> first_21_transpose_x_0 = const()[name = tensor<string, []>("first_21_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> first_21_transpose_y_0 = const()[name = tensor<string, []>("first_21_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_132_perm_0 = const()[name = tensor<string, []>("transpose_132_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_133_perm_0 = const()[name = tensor<string, []>("transpose_133_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 12, 64, 128]> transpose_201 = transpose(perm = transpose_133_perm_0, x = input_tensor_83_cast_fp16)[name = tensor<string, []>("transpose_201")];
            tensor<fp16, [1, 12, 128, 64]> transpose_202 = transpose(perm = transpose_132_perm_0, x = input_tensor_79_cast_fp16)[name = tensor<string, []>("transpose_202")];
            tensor<fp16, [1, 12, 128, 128]> first_21_cast_fp16 = matmul(transpose_x = first_21_transpose_x_0, transpose_y = first_21_transpose_y_0, x = transpose_202, y = transpose_201)[name = tensor<string, []>("first_21_cast_fp16")];
            tensor<fp16, []> _inversed_first_23_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_first_23_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 12, 128, 128]> _inversed_first_23_cast_fp16 = mul(x = first_21_cast_fp16, y = _inversed_first_23_y_0_to_fp16)[name = tensor<string, []>("_inversed_first_23_cast_fp16")];
            tensor<fp16, [1, 12, 128, 128]> input_1_cast_fp16 = add(x = _inversed_first_23_cast_fp16, y = second_31_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_1939 = const()[name = tensor<string, []>("op_1939"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 128, 128]> x_13_cast_fp16 = softmax(axis = var_1939, x = input_1_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<bool, []> input_tensor_85_transpose_x_0 = const()[name = tensor<string, []>("input_tensor_85_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_tensor_85_transpose_y_0 = const()[name = tensor<string, []>("input_tensor_85_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 128, 64]> transpose_203 = transpose(perm = var_1926, x = input_tensor_81_cast_fp16)[name = tensor<string, []>("transpose_203")];
            tensor<fp16, [1, 12, 128, 64]> input_tensor_85_cast_fp16 = matmul(transpose_x = input_tensor_85_transpose_x_0, transpose_y = input_tensor_85_transpose_y_0, x = x_13_cast_fp16, y = transpose_203)[name = tensor<string, []>("input_tensor_85_cast_fp16")];
            tensor<int32, [4]> var_1946 = const()[name = tensor<string, []>("op_1946"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_1984 = const()[name = tensor<string, []>("op_1984"), val = tensor<int32, [3]>([1, 128, 768])];
            tensor<fp16, [1, 128, 12, 64]> transpose_200 = transpose(perm = var_1946, x = input_tensor_85_cast_fp16)[name = tensor<string, []>("transpose_200")];
            tensor<fp16, [1, 128, 768]> x_15_cast_fp16 = reshape(shape = var_1984, x = transpose_200)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<fp16, [768, 768]> transpose_3_to_fp16 = const()[name = tensor<string, []>("transpose_3_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50474048)))];
            tensor<fp16, [768]> first_25_bias_0_to_fp16 = const()[name = tensor<string, []>("first_25_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51653760)))];
            tensor<fp16, [1, 128, 768]> first_25_cast_fp16 = linear(bias = first_25_bias_0_to_fp16, weight = transpose_3_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("first_25_cast_fp16")];
            tensor<fp16, [1, 128, 768]> input_tensor_95_cast_fp16 = add(x = first_25_cast_fp16, y = x_1_cast_fp16)[name = tensor<string, []>("input_tensor_95_cast_fp16")];
            tensor<bool, []> var_1990 = const()[name = tensor<string, []>("op_1990"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_1992 = const()[name = tensor<string, []>("op_1992"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_33_cast_fp16 = reduce_mean(axes = var_1992, keep_dims = var_1990, x = input_tensor_95_cast_fp16)[name = tensor<string, []>("second_33_cast_fp16")];
            tensor<fp16, [1, 128, 768]> input_tensor_97_cast_fp16 = sub(x = input_tensor_95_cast_fp16, y = second_33_cast_fp16)[name = tensor<string, []>("input_tensor_97_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_79_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_79_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 768]> input_tensor_99_cast_fp16 = pow(x = input_tensor_97_cast_fp16, y = initializers_onnx_initializer_79_to_fp16)[name = tensor<string, []>("input_tensor_99_cast_fp16")];
            tensor<bool, []> var_1998 = const()[name = tensor<string, []>("op_1998"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2000 = const()[name = tensor<string, []>("op_2000"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_27_cast_fp16 = reduce_mean(axes = var_2000, keep_dims = var_1998, x = input_tensor_99_cast_fp16)[name = tensor<string, []>("first_27_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_80_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_80_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_101_cast_fp16 = add(x = first_27_cast_fp16, y = initializers_onnx_initializer_80_to_fp16)[name = tensor<string, []>("input_tensor_101_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_37_cast_fp16 = sqrt(x = input_tensor_101_cast_fp16)[name = tensor<string, []>("second_37_cast_fp16")];
            tensor<fp16, [1, 128, 768]> first_29_cast_fp16 = real_div(x = input_tensor_97_cast_fp16, y = second_37_cast_fp16)[name = tensor<string, []>("first_29_cast_fp16")];
            tensor<fp16, [768]> initializers_onnx_initializer_81_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_81_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51655360)))];
            tensor<fp16, [1, 128, 768]> first_31_cast_fp16 = mul(x = first_29_cast_fp16, y = initializers_onnx_initializer_81_to_fp16)[name = tensor<string, []>("first_31_cast_fp16")];
            tensor<fp16, [768]> initializers_onnx_initializer_82_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_82_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51656960)))];
            tensor<fp16, [1, 128, 768]> x_17_cast_fp16 = add(x = first_31_cast_fp16, y = initializers_onnx_initializer_82_to_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<fp16, [3072, 768]> transpose_4_to_fp16 = const()[name = tensor<string, []>("transpose_4_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51658560)))];
            tensor<fp16, [3072]> first_33_bias_0_to_fp16 = const()[name = tensor<string, []>("first_33_bias_0_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56377216)))];
            tensor<fp16, [1, 128, 3072]> first_33_cast_fp16 = linear(bias = first_33_bias_0_to_fp16, weight = transpose_4_to_fp16, x = x_17_cast_fp16)[name = tensor<string, []>("first_33_cast_fp16")];
            tensor<fp16, [3072, 768]> transpose_5_to_fp16 = const()[name = tensor<string, []>("transpose_5_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56383424)))];
            tensor<fp16, [1, 128, 3072]> input_3_cast_fp16 = linear(bias = first_33_bias_0_to_fp16, weight = transpose_5_to_fp16, x = x_17_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [1, 128, 3072]> second_45_cast_fp16 = silu(x = input_3_cast_fp16)[name = tensor<string, []>("second_45_cast_fp16")];
            tensor<fp16, [1, 128, 3072]> x_19_cast_fp16 = mul(x = first_33_cast_fp16, y = second_45_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<fp16, [768, 3072]> transpose_6_to_fp16 = const()[name = tensor<string, []>("transpose_6_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61102080)))];
            tensor<fp16, [1, 128, 768]> first_35_cast_fp16 = linear(bias = first_25_bias_0_to_fp16, weight = transpose_6_to_fp16, x = x_19_cast_fp16)[name = tensor<string, []>("first_35_cast_fp16")];
            tensor<fp16, [1, 128, 768]> input_tensor_103_cast_fp16 = add(x = first_35_cast_fp16, y = x_17_cast_fp16)[name = tensor<string, []>("input_tensor_103_cast_fp16")];
            tensor<bool, []> var_2018 = const()[name = tensor<string, []>("op_2018"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2020 = const()[name = tensor<string, []>("op_2020"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> second_47_cast_fp16 = reduce_mean(axes = var_2020, keep_dims = var_2018, x = input_tensor_103_cast_fp16)[name = tensor<string, []>("second_47_cast_fp16")];
            tensor<fp16, [1, 128, 768]> input_tensor_105_cast_fp16 = sub(x = input_tensor_103_cast_fp16, y = second_47_cast_fp16)[name = tensor<string, []>("input_tensor_105_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_86_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_86_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 128, 768]> input_tensor_107_cast_fp16 = pow(x = input_tensor_105_cast_fp16, y = initializers_onnx_initializer_86_to_fp16)[name = tensor<string, []>("input_tensor_107_cast_fp16")];
            tensor<bool, []> var_2026 = const()[name = tensor<string, []>("op_2026"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_2028 = const()[name = tensor<string, []>("op_2028"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 128, 1]> first_37_cast_fp16 = reduce_mean(axes = var_2028, keep_dims = var_2026, x = input_tensor_107_cast_fp16)[name = tensor<string, []>("first_37_cast_fp16")];
            tensor<fp16, []> initializers_onnx_initializer_87_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_87_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 128, 1]> input_tensor_109_cast_fp16 = add(x = first_37_cast_fp16, y = initializers_onnx_initializer_87_to_fp16)[name = tensor<string, []>("input_tensor_109_cast_fp16")];
            tensor<fp16, [1, 128, 1]> second_51_cast_fp16 = sqrt(x = input_tensor_109_cast_fp16)[name = tensor<string, []>("second_51_cast_fp16")];
            tensor<fp16, [1, 128, 768]> first_39_cast_fp16 = real_div(x = input_tensor_105_cast_fp16, y = second_51_cast_fp16)[name = tensor<string, []>("first_39_cast_fp16")];
            tensor<fp16, [768]> initializers_onnx_initializer_88_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_88_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65820736)))];
            tensor<fp16, [1, 128, 768]> first_41_cast_fp16 = mul(x = first_39_cast_fp16, y = initializers_onnx_initializer_88_to_fp16)[name = tensor<string, []>("first_41_cast_fp16")];
            tensor<fp16, [768]> initializers_onnx_initializer_89_to_fp16 = const()[name = tensor<string, []>("initializers_onnx_initializer_89_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65822336)))];
            tensor<fp16, [1, 128, 768]> x_21_cast_fp16 = add(x = first_41_cast_fp16, y = initializers_onnx_initializer_89_to_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [2304, 768]> transpose_7_to_fp16 = const()[name = tensor<string, []>("transpose_7_to_fp16"), val = tensor<fp16, [2304, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65823936)))];
            tensor<fp16, [1, 128, 2304]> input_tensor_111_cast_fp16 = linear(bias = input_tensor_15_bias_0_to_fp16, weight = transpose_7_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("input_tensor_111_cast_fp16")];
            tensor<int32, [5]> var_2078 = const()[name = tensor<string, []>("op_2078"), val = tensor<int32, [5]>([1, 128, 3, 12, 64])];
            tensor<fp16, [1, 128, 3, 12, 64]> input_tensor_119_cast_fp16 = reshape(shape = var_2078, x = input_tensor_111_cast_fp16)[name = tensor<string, []>("input_tensor_119_cast_fp16")];
            tensor<int32, [5]> input_tensor_123_begin_0 = const()[name = tensor<string, []>("input_tensor_123_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> input_tensor_123_end_0 = const()[name = tensor<string, []>("input_tensor_123_end_0"), val = tensor<int32, [5]>([1, 128, 1, 12, 64])];
            tensor<bool, [5]> input_tensor_123_end_mask_0 = const()[name = tensor<string, []>("input_tensor_123_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_123_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_123_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_123_cast_fp16 = slice_by_index(begin = input_tensor_123_begin_0, end = input_tensor_123_end_0, end_mask = input_tensor_123_end_mask_0, squeeze_mask = input_tensor_123_squeeze_mask_0, x = input_tensor_119_cast_fp16)[name = tensor<string, []>("input_tensor_123_cast_fp16")];
            tensor<int32, [5]> input_tensor_125_begin_0 = const()[name = tensor<string, []>("input_tensor_125_begin_0"), val = tensor<int32, [5]>([0, 0, 1, 0, 0])];
            tensor<int32, [5]> input_tensor_125_end_0 = const()[name = tensor<string, []>("input_tensor_125_end_0"), val = tensor<int32, [5]>([1, 128, 2, 12, 64])];
            tensor<bool, [5]> input_tensor_125_end_mask_0 = const()[name = tensor<string, []>("input_tensor_125_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_125_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_125_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_125_cast_fp16 = slice_by_index(begin = input_tensor_125_begin_0, end = input_tensor_125_end_0, end_mask = input_tensor_125_end_mask_0, squeeze_mask = input_tensor_125_squeeze_mask_0, x = input_tensor_119_cast_fp16)[name = tensor<string, []>("input_tensor_125_cast_fp16")];
            tensor<int32, [5]> input_tensor_127_begin_0 = const()[name = tensor<string, []>("input_tensor_127_begin_0"), val = tensor<int32, [5]>([0, 0, 2, 0, 0])];
            tensor<int32, [5]> input_tensor_127_end_0 = const()[name = tensor<string, []>("input_tensor_127_end_0"), val = tensor<int32, [5]>([1, 128, 3, 12, 64])];
            tensor<bool, [5]> input_tensor_127_end_mask_0 = const()[name = tensor<string, []>("input_tensor_127_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_127_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_127_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_127_cast_fp16 = slice_by_index(begin = input_tensor_127_begin_0, end = input_tensor_127_end_0, end_mask = input_tensor_127_end_mask_0, squeeze_mask = input_tensor_127_squeeze_mask_0, x = input_tensor_119_cast_fp16)[name = tensor<string, []>("input_tensor_127_cast_fp16")];
            tensor<int32, [1]> var_2131_axes_0 = const()[name = tensor<string, []>("op_2131_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 12, 64]> var_2131_cast_fp16 = expand_dims(axes = var_2131_axes_0, x = input_tensor_127_cast_fp16)[name = tensor<string, []>("op_2131_cast_fp16")];
            tensor<int32, [4]> var_2215_begin_0 = const()[name = tensor<string, []>("op_2215_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_2215_end_0 = const()[name = tensor<string, []>("op_2215_end_0"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<bool, [4]> var_2215_end_mask_0 = const()[name = tensor<string, []>("op_2215_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> var_2215_cast_fp16 = slice_by_index(begin = var_2215_begin_0, end = var_2215_end_0, end_mask = var_2215_end_mask_0, x = input_tensor_123_cast_fp16)[name = tensor<string, []>("op_2215_cast_fp16")];
            tensor<int32, [4]> input_tensor_139_begin_0 = const()[name = tensor<string, []>("input_tensor_139_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 32])];
            tensor<int32, [4]> input_tensor_139_end_0 = const()[name = tensor<string, []>("input_tensor_139_end_0"), val = tensor<int32, [4]>([1, 128, 12, 64])];
            tensor<bool, [4]> input_tensor_139_end_mask_0 = const()[name = tensor<string, []>("input_tensor_139_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_139_cast_fp16 = slice_by_index(begin = input_tensor_139_begin_0, end = input_tensor_139_end_0, end_mask = input_tensor_139_end_mask_0, x = input_tensor_123_cast_fp16)[name = tensor<string, []>("input_tensor_139_cast_fp16")];
            tensor<int32, [4]> var_2235_begin_0 = const()[name = tensor<string, []>("op_2235_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_2235_end_0 = const()[name = tensor<string, []>("op_2235_end_0"), val = tensor<int32, [4]>([1, 128, 12, 32])];
            tensor<bool, [4]> var_2235_end_mask_0 = const()[name = tensor<string, []>("op_2235_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> var_2235_cast_fp16 = slice_by_index(begin = var_2235_begin_0, end = var_2235_end_0, end_mask = var_2235_end_mask_0, x = input_tensor_125_cast_fp16)[name = tensor<string, []>("op_2235_cast_fp16")];
            tensor<int32, [4]> input_tensor_141_begin_0 = const()[name = tensor<string, []>("input_tensor_141_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 32])];
            tensor<int32, [4]> input_tensor_141_end_0 = const()[name = tensor<string, []>("input_tensor_141_end_0"), val = tensor<int32, [4]>([1, 128, 12, 64])];
            tensor<bool, [4]> input_tensor_141_end_mask_0 = const()[name = tensor<string, []>("input_tensor_141_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 12, 32]> input_tensor_141_cast_fp16 = slice_by_index(begin = input_tensor_141_begin_0, end = input_tensor_141_end_0, end_mask = input_tensor_141_end_mask_0, x = input_tensor_125_cast_fp16)[name = tensor<string, []>("input_tensor_141_cast_fp16")];
            tensor<fp16, []> const_2_promoted_to_fp16 = const()[name = tensor<string, []>("const_2_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 128, 12, 32]> var_2257_cast_fp16 = mul(x = input_tensor_139_cast_fp16, y = const_2_promoted_to_fp16)[name = tensor<string, []>("op_2257_cast_fp16")];
            tensor<fp16, []> const_3_promoted_to_fp16 = const()[name = tensor<string, []>("const_3_promoted_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 128, 12, 32]> var_2258_cast_fp16 = mul(x = input_tensor_141_cast_fp16, y = const_3_promoted_to_fp16)[name = tensor<string, []>("op_2258_cast_fp16")];
            tensor<int32, []> var_2263 = const()[name = tensor<string, []>("op_2263"), val = tensor<int32, []>(-1)];
            tensor<bool, []> first_43_interleave_0 = const()[name = tensor<string, []>("first_43_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> first_43_cast_fp16 = concat(axis = var_2263, interleave = first_43_interleave_0, values = (var_2257_cast_fp16, var_2215_cast_fp16))[name = tensor<string, []>("first_43_cast_fp16")];
            tensor<int32, []> var_2266 = const()[name = tensor<string, []>("op_2266"), val = tensor<int32, []>(-1)];
            tensor<bool, []> first_45_interleave_0 = const()[name = tensor<string, []>("first_45_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> first_45_cast_fp16 = concat(axis = var_2266, interleave = first_45_interleave_0, values = (var_2258_cast_fp16, var_2235_cast_fp16))[name = tensor<string, []>("first_45_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> first_47_cast_fp16 = mul(x = input_tensor_123_cast_fp16, y = second_17_to_fp16)[name = tensor<string, []>("first_47_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> first_49_cast_fp16 = mul(x = input_tensor_125_cast_fp16, y = second_17_to_fp16)[name = tensor<string, []>("first_49_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> second_65_cast_fp16 = mul(x = first_43_cast_fp16, y = second_21_to_fp16)[name = tensor<string, []>("second_65_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> second_67_cast_fp16 = mul(x = first_45_cast_fp16, y = second_21_to_fp16)[name = tensor<string, []>("second_67_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> var_2420_cast_fp16 = add(x = first_47_cast_fp16, y = second_65_cast_fp16)[name = tensor<string, []>("op_2420_cast_fp16")];
            tensor<fp16, [1, 128, 12, 64]> var_2422_cast_fp16 = add(x = first_49_cast_fp16, y = second_67_cast_fp16)[name = tensor<string, []>("op_2422_cast_fp16")];
            tensor<int32, []> var_2423 = const()[name = tensor<string, []>("op_2423"), val = tensor<int32, []>(-1)];
            tensor<bool, []> input_tensor_169_interleave_0 = const()[name = tensor<string, []>("input_tensor_169_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_169_cast_fp16 = concat(axis = var_2423, interleave = input_tensor_169_interleave_0, values = var_2420_cast_fp16)[name = tensor<string, []>("input_tensor_169_cast_fp16")];
            tensor<int32, []> var_2426 = const()[name = tensor<string, []>("op_2426"), val = tensor<int32, []>(-1)];
            tensor<bool, []> input_tensor_171_interleave_0 = const()[name = tensor<string, []>("input_tensor_171_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_171_cast_fp16 = concat(axis = var_2426, interleave = input_tensor_171_interleave_0, values = var_2422_cast_fp16)[name = tensor<string, []>("input_tensor_171_cast_fp16")];
            tensor<int32, [1]> var_2430_axes_0 = const()[name = tensor<string, []>("op_2430_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 12, 64]> var_2430_cast_fp16 = expand_dims(axes = var_2430_axes_0, x = input_tensor_169_cast_fp16)[name = tensor<string, []>("op_2430_cast_fp16")];
            tensor<int32, [1]> var_2432_axes_0 = const()[name = tensor<string, []>("op_2432_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 12, 64]> var_2432_cast_fp16 = expand_dims(axes = var_2432_axes_0, x = input_tensor_171_cast_fp16)[name = tensor<string, []>("op_2432_cast_fp16")];
            tensor<int32, []> var_2433 = const()[name = tensor<string, []>("op_2433"), val = tensor<int32, []>(2)];
            tensor<bool, []> input_tensor_173_interleave_0 = const()[name = tensor<string, []>("input_tensor_173_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 3, 12, 64]> input_tensor_173_cast_fp16 = concat(axis = var_2433, interleave = input_tensor_173_interleave_0, values = (var_2430_cast_fp16, var_2432_cast_fp16, var_2131_cast_fp16))[name = tensor<string, []>("input_tensor_173_cast_fp16")];
            tensor<int32, [5]> input_tensor_175_begin_0 = const()[name = tensor<string, []>("input_tensor_175_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> input_tensor_175_end_0 = const()[name = tensor<string, []>("input_tensor_175_end_0"), val = tensor<int32, [5]>([1, 128, 1, 12, 64])];
            tensor<bool, [5]> input_tensor_175_end_mask_0 = const()[name = tensor<string, []>("input_tensor_175_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_175_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_175_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_175_cast_fp16 = slice_by_index(begin = input_tensor_175_begin_0, end = input_tensor_175_end_0, end_mask = input_tensor_175_end_mask_0, squeeze_mask = input_tensor_175_squeeze_mask_0, x = input_tensor_173_cast_fp16)[name = tensor<string, []>("input_tensor_175_cast_fp16")];
            tensor<int32, [5]> input_tensor_179_begin_0 = const()[name = tensor<string, []>("input_tensor_179_begin_0"), val = tensor<int32, [5]>([0, 0, 1, 0, 0])];
            tensor<int32, [5]> input_tensor_179_end_0 = const()[name = tensor<string, []>("input_tensor_179_end_0"), val = tensor<int32, [5]>([1, 128, 2, 12, 64])];
            tensor<bool, [5]> input_tensor_179_end_mask_0 = const()[name = tensor<string, []>("input_tensor_179_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_179_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_179_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
            tensor<fp16, [1, 128, 12, 64]> input_tensor_179_cast_fp16 = slice_by_index(begin = input_tensor_179_begin_0, end = input_tensor_179_end_0, end_mask = input_tensor_179_end_mask_0, squeeze_mask = input_tensor_179_squeeze_mask_0, x = input_tensor_173_cast_fp16)[name = tensor<string, []>("input_tensor_179_cast_fp16")];
            tensor<int32, [5]> input_tensor_177_begin_0 = const()[name = tensor<string, []>("input_tensor_177_begin_0"), val = tensor<int32, [5]>([0, 0, 2, 0, 0])];
            tensor<int32, [5]> input_tensor_177_end_0 = const()[name = tensor<string, []>("input_tensor_177_end_0"), val = tensor<int32, [5]>([1, 128, 3, 12, 64])];
            tensor<bool, [5]> input_tensor_177_end_mask_0 = const()[name = tensor<string, []>("input_tensor_177_end_mask_0"), val = tensor<bool, [5]>([true, true, false, true, true])];
            tensor<bool, [5]> input_tensor_177_squeeze_mask_0 = const()[name = tensor<string, []>("input_tensor_177_squeeze_mask_0"), val = tensor<bool, [5]>([false, false, true, false, false])];
